技术文档/ELisp-Elements/elispelement-cn.org

#+title: Emacs Lisp 元素
#+author: Protesilaos Stavrou
#+email: info@protesilaos.com
#+language: zh-CN
#+options: ':t toc:nil author:t email:t num:t
#+startup: content
#+macro: stable-version 1.0.0
#+macro: release-date 2025-04-12
#+macro: kbd @@texinfo:@kbd{@@$1@@texinfo:}@@
#+texinfo_filename: elispelem.info
#+texinfo_dir_category: Emacs misc features
#+texinfo_dir_title: Emacs Lisp Elements: (elispelem)
#+texinfo_dir_desc: Emacs Lisp 的宏观视角
#+texinfo_header: @set MAINTAINERSITE @uref{https://protesilaos.com,maintainer webpage}
#+texinfo_header: @set MAINTAINER Protesilaos Stavrou
#+texinfo_header: @set MAINTAINEREMAIL @email{info@protesilaos.com}
#+texinfo_header: @set MAINTAINERCONTACT @uref{mailto:info@protesilaos.com,contact the maintainer}

#+texinfo: @insertcopying

本书由 Protesilaos Stavrou（亦称“Prot”）撰写，提供了 Emacs Lisp 编程语言的宏观视角。

此处提供的信息对应于 {{{stable-version}}} 稳定版本，发布于 {{{release-date}}}。

+ 官方页面： <https://protesilaos.com/emacs/emacs-lisp-elements>
+ Git 仓库： <https://github.com/protesilaos/emacs-lisp-elements>

#+toc: headlines 8 在此处插入 TOC，包含八级标题

* 开始使用 Emacs Lisp
:PROPERTIES:
:CUSTOM_ID: h:getting-started-with-emacs-lisp
:END:

本书旨在为你提供 Emacs Lisp（亦称“Elisp”）的宏观视角。这是你用来扩展 Emacs 的编程语言。Emacs 是一个可编程的文本编辑器：它解释 Emacs Lisp 并相应地执行操作。你可以在不编写任何一行代码的情况下使用 Emacs：它已经具备了许多功能。不过，你随时可以通过对你自己编写或从他人处（例如以包的形式）获取的 Elisp 代码进行求值，来对其编程以精确地执行你想要的操作。

对你自己的文本编辑器进行编程既有用又有趣。例如，你可以将一系列你反复执行的操作组合成一个单一命令，然后将其分配给一个按键绑定：按下该键——砰！——一次性执行所有中间任务。这让你更高效，同时也将编辑器变成了一个舒适的工作环境。

有趣的部分在于你如何着手编写代码。没有任何你必须遵守的义务。完全没有！你为了编程而编程。这是一种扩展你视野的娱乐活动。此外，你还能培养你的 Elisp 技能，如果你将来选择修改 Emacs 的某些行为，这些技能可能会很有用。

捣鼓 Emacs 是体验的一部分。它教会你毫不妥协地坚持自己对于编辑器如何工作的看法。关键在于掌握足够的 Elisp 知识，这样你就不会因为一些琐碎的事情不起作用而花费太多时间去“玩乐”或感到沮丧。我写这篇文章时，自己就是一个没有计算机科学或相关学科背景的捣鼓者：我是通过在编辑器中反复试验、摸索来学习 Emacs Lisp 的。我名义上的目标是改进我一遍又一遍重复的某些微小动作：我追求效率，结果却发现了更深刻的东西。学习扩展我的编辑器是一次充实的体验，结果我变得更有效率了。Emacs 做了我想让它做的事情，我对此很满意。

本书的每一章通常都简短且切中要点。有些对初学者更友好，而另一些则深入探讨了高级主题。各章之间存在链接，这正是一个参考手册应有的做法。你可以来回查阅以找到你需要的内容。

你在这里会看到文本是散文和代码的结合。后者可能是实际的 Elisp 代码，也可能是捕捉底层模式的伪代码。我鼓励你在 Emacs 内部或随时可以打开 Emacs 的情况下阅读本书。这样，你可以尝试运行我给你的函数，以进一步体会它们的细微之处。

我采用的“宏观视角”方法旨在涵盖我在使用 Emacs Lisp 时经常遇到的概念。本书不能替代 Emacs Lisp 参考手册，并且绝不应被视为我对任何 Elisp 形式进行评论的真理之源。

祝你好运，享受过程！

* 求值 Emacs Lisp
:PROPERTIES:
:CUSTOM_ID: h:evaluate-emacs-lisp
:END:

你在 Emacs 中做的每一件事都会调用某个函数。它对 Emacs Lisp 代码进行求值，读取返回值并产生副作用 ([[#h:side-effect-and-return-value][副作用与返回值]])。

#+findex: Interactive functions are commands 交互式函数即命令
你在键盘上键入一个键，一个字符就被写入当前缓冲区。那是一个绑定到按键的函数。它实际上是一个 /交互式/ 函数，因为你是通过按键绑定而不是通过某个程序来调用它。交互式函数被称为“命令”。不过，不要让交互性这个实现细节分散你的注意力，要认识到你在 Emacs 中执行的每一个动作都涉及 Emacs Lisp 的求值。

#+findex: execute-extended-command
另一种常见的交互模式是使用 {{{kbd(M-x)}}} (~execute-extended-command~) 键，它默认运行命令 ~execute-extended-command~：它会产生一个 minibuffer 提示，要求你按名称选择一个命令，然后继续执行它。

#+findex: eval-last-sexp
#+findex: eval-buffer
#+findex: eval-region
Emacs 可以从任何地方求值 Elisp 代码。如果你的缓冲区中有一些 Elisp 代码，你可以将光标放在其闭合括号的末尾，然后键入 {{{kbd(C-x C-e)}}} (~eval-last-sexp~)。类似地，你可以使用命令 ~eval-buffer~ 和 ~eval-region~ 分别对当前缓冲区或高亮区域进行操作。

#+vindex: buffer-file-name
~eval-last-sexp~ 也适用于符号 ([[#h:symbols-balanced-expressions-and-quoting][符号、平衡表达式与引用]])。例如，如果你将光标放在变量 ~buffer-file-name~ 的末尾并使用 {{{kbd(C-x C-e)}}} (~eval-last-sexp~)，你将得到该变量的值，这个值要么是 ~nil~，要么是你正在编辑的文件在文件系统中的路径。

#+findex: eval-expression
有时上述方法不适用于你想要做的事情。假设你打算编写一个复制当前缓冲区文件路径的命令。为此，你的代码需要测试变量 ~buffer-file-name~ 的值 ([[#h:buffers-as-data-structures][作为数据结构的缓冲区]])。但你不想在你的实际文件中输入 ~buffer-file-name~，然后使用前面提到的某个 Elisp 求值命令，最后再撤销你的编辑。这既繁琐又容易出错！在当前缓冲区中运行 Elisp 的最佳方法是键入 {{{kbd(M-:)}}} (~eval-expression~): 它会打开 minibuffer 并期望你写入想要求值的代码。从那里键入 {{{kbd(RET)}}} 以继续。求值是在最后一个缓冲区作为当前缓冲区的情况下完成的（即调用 ~eval-expression~ 之前的当前缓冲区）。

这里有一些 Emacs Lisp 代码，你可能想在 (i) 对应于文件的缓冲区 与 (ii) 与磁盘上任何文件都无关的缓冲区 中尝试运行。

#+begin_src emacs-lisp
;; Use `eval-expression' to evaluate this code in a file-visiting
;; buffer versus a buffer that does not visit any file.
(if buffer-file-name
    (message "The path to this file is `%s'" buffer-file-name)
  (message "Sorry mate, this buffer is not visiting a file"))
#+end_src

#+findex: ielm
#+findex: lisp-interaction-mode
#+vindex: initial-major-mode
#+findex: eval-print-last-sexp
#+findex: eval-last-sexp
当你在试验代码时，你想测试它的行为。使用命令 ~ielm~ 打开一个交互式 shell。它会把你带到一个提示符下，你可以在那里键入任何 Elisp 代码并按 {{{kbd(RET)}}} 来求值它。返回值会打印在紧随其后下方。或者，切换到 =*scratch*= 缓冲区。如果它正在使用主模式 ~lisp-interaction-mode~（这是变量 ~initial-major-mode~ 的默认值），那么你可以在该缓冲区中自由移动，并在某些代码的末尾键入 {{{kbd(C-j)}}} (~eval-print-last-sexp~) 来对其求值。这与 ~eval-last-sexp~ 的工作方式几乎相同，但附加效果是把返回值放在你刚刚求值的表达式正下方。

#+cindex: Introspect Emacs Lisp 内省 Emacs Lisp
#+vindex: major-mode
#+findex: describe-variable
#+findex: describe-function
#+findex: describe-keymap
#+findex: describe-key
#+findex: describe-symbol
除此之外，你可以依赖 Emacs 的自文档特性来弄清楚当前的状态。例如，要了解变量 ~major-mode~ 的缓冲区局部值，你可以执行 {{{kbd(C-h v)}}} (~describe-variable~)，然后搜索该变量。生成的帮助缓冲区将告知你 ~major-mode~ 的当前值。这个帮助命令以及许多其他命令，如 ~describe-function~、~describe-keymap~、~describe-key~ 和 ~describe-symbol~，提供了关于 Emacs 对给定对象所知信息的深入了解。帮助缓冲区将显示相关信息，例如定义给定函数的文件路径，或者一个变量是否被声明为缓冲区局部变量。

#+cindex: Emacs is self-documenting Emacs 是自文档化的
Emacs 是“自文档化的”，因为它报告其自身状态。你不需要显式更新帮助缓冲区。这通过求值相关代码自动发生：Emacs 实际上向你展示你正在处理的任何东西的最新值。

* 副作用与返回值
:PROPERTIES:
:CUSTOM_ID: h:side-effect-and-return-value
:END:

Emacs Lisp 拥有函数。它们接受输入并产生输出。在其最纯粹的形式中，函数是一个仅返回值而不改变其环境任何东西的计算。一个函数的返回值被用作另一个函数的输入，这实际上形成了一个计算链。因此，你可以依赖一个函数的返回值来表达类似“如果这个成功了，那么也做另一件事，否则做别的事情甚至什么都不做”的意思。

Elisp 是扩展和控制 Emacs 的语言。这意味着它也会影响编辑器的状态。当你运行一个函数时，它可以进行永久性更改，例如在光标处插入一些文本、删除一个缓冲区、创建一个新窗口等等。这些更改将对未来的函数调用产生影响。例如，如果前一个函数删除了某个缓冲区，那么本应写入该缓冲区的下一个函数就无法再执行其任务了：缓冲区已经消失了！

当你编写 Elisp 时，你必须同时考虑返回值和副作用。如果你很草率，你会因为所有那些未经深思熟虑的环境更改而得到意想不到的结果。但如果你细致地使用副作用，你就能够将 Elisp 的潜力发挥到极致。例如，想象你定义了一个函数，它遵循这样的逻辑：“创建一个缓冲区，转到那里，写入一些文本，将缓冲区保存到我偏好的位置的文件中，然后回到我调用此函数之前的位置，同时保持创建的缓冲区打开。” 所有这些都是副作用，而且它们都很有用。你的函数可能也有一些有意义的返回值，你可以将其用作另一个函数的输入。例如，你的函数可能会返回它生成的缓冲区对象，以便下一个函数可以在那里做些事情，比如在一个单独的 frame 中显示该缓冲区并使其文本变大。

其思想是操纵编辑器的状态，让 Emacs 做你设想的事情。有时这意味着你的代码有副作用。其他时候，副作用是无用的，甚至与你预期结果背道而驰。随着你获得更多经验和扩展技能范围，你将不断提炼你对于需要做什么的直觉 ([[#h:symbols-balanced-expressions-and-quoting][符号、平衡表达式与引用]])。没问题；别紧张！

