技术文档/ELisp-Elements/elispelement-cn.tex
\section{作为数据结构的缓冲区}
\label{sec:orgc0d6740}
缓冲区以字符序列的形式持有数据。例如，这些数据就是你打开文件时看到的文本。每个字符都存在于一个给定的位置，这是一个数字。函数 \texttt{point} 给出你所在点位（point）的位置，这通常对应于光标所在的位置 (\hyperref[sec:org5e72a31]{求值 Emacs Lisp})。在缓冲区的开头，\textasciitilde{}point\textasciitilde{} 返回值 \texttt{1} (\hyperref[sec:org7601617]{副作用与返回值})。有大量函数返回缓冲区位置，例如 \texttt{point-min\textasciitilde{}、\textasciitilde{}point-max\textasciitilde{}、\textasciitilde{}line-beginning-position} 和 \texttt{re-search-forward\textasciitilde{}。其中一些会有副作用，比如 \textasciitilde{}re-search-forward} 会将光标移动到给定的匹配项。

当你在 Emacs Lisp 中编程时，你经常依赖缓冲区来做以下一些事情：

\begin{description}
\item[{将文件内容提取为字符串}] 将缓冲区视为一个大字符串。你可以使用函数 \texttt{buffer-string} 将其全部内容获取为一个可能非常巨大的字符串。你也可以使用 \texttt{buffer-substring} 函数或其对应的 \texttt{buffer-substring-no-properties} 函数获取两个缓冲区位置之间的子字符串 (\hyperref[sec:orgea51fad]{文本自身具有属性})。想象一下，你将其作为更广泛操作的一部分来执行，该操作 (i) 打开文件，(ii) 转到特定位置，(iii) 复制找到的文本，(iv) 切换到另一个缓冲区，以及 (v) 将找到的内容写入这个新缓冲区。
\end{description}

\begin{description}
\item[{呈现某些操作的结果}] 你可能有一个显示即将到来的假期的函数。你的代码在后台进行计算，并最终将一些文本写入缓冲区。最终产品被展示出来。取决于你如何处理它，你可能需要求值函数 \texttt{get-buffer-create} 或其更严格的替代方案 \texttt{get-buffer\textasciitilde{}。如果你需要清除已存在缓冲区的内容，你可能会使用 \textasciitilde{}with-current-buffer} 宏临时切换到你目标指向的缓冲区，然后要么调用函数 \texttt{erase-buffer} 删除所有内容，要么使用 \texttt{delete-region} 将删除范围限制在两个缓冲区位置之间。最后，函数 \texttt{display-buffer} 或 \texttt{pop-to-buffer} 会将缓冲区置于 Emacs 窗口中。
\end{description}

\begin{description}
\item[{将变量与给定缓冲区关联}] 在 Emacs Lisp 中，变量可以采用缓冲区局部值，该值与其全局对应值不同。有些变量甚至被声明为始终是缓冲区局部的，例如 \texttt{buffer-file-name\textasciitilde{}、\textasciitilde{}fill-column} 和 \texttt{default-directory\textasciitilde{}。假设你正在做类似返回访问给定目录中文件的缓冲区列表的事情。你会遍历 \textasciitilde{}buffer-list} 函数的返回值，通过测试 \texttt{buffer-file-name} 的特定值来相应地过滤结果 (\hyperref[sec:org9ad3ad6]{使用 \texttt{if\textasciitilde{}、\textasciitilde{}cond} 等进行基本控制流})。这个特定变量始终可用，不过你总是可以使用 \texttt{setq-local} 宏将值赋给当前缓冲区中的变量。
\end{description}

后一点也许是最开放的一点。缓冲区就像一组变量的集合，包括它们的内容、它们正在运行的主模式以及它们拥有的所有缓冲区局部值。在下面的代码块中，我使用 \texttt{seq-filter} 函数遍历函数 \texttt{buffer-list} 的返回值 (\hyperref[sec:orgb51d706]{符号、平衡表达式与引用})。

\begin{verbatim}
(seq-filter
 (lambda (buffer)
   "Return BUFFER if it is visible and its major mode derives from `text-mode'."
   (with-current-buffer buffer
     ;; The convention for buffers which are not meant to be seen by
     ;; the user is to start their name with an empty space.  We are
     ;; not interested in those right now.
     (and (not (string-prefix-p " " (buffer-name buffer)))
          (derived-mode-p 'text-mode))))
 (buffer-list))
\end{verbatim}

这将返回一个缓冲区对象列表，这些对象通过了以下测试：(i) 对用户“可见” 且 (ii) 它们的主模式要么是 \texttt{text-mode} 要么是从中派生的。上述代码也可以这样写 (\hyperref[sec:orgf242639]{何时使用命名函数或 lambda 函数})：

\begin{verbatim}
(defun my-buffer-visble-and-text-p (buffer)
  "Return BUFFER if it is visible and its major mode derives from `text-mode'."
  (with-current-buffer buffer
    ;; The convention for buffers which are not meant to be seen by
    ;; the user is to start their name with an empty space.  We are
    ;; not interested in those right now.
    (and (not (string-prefix-p " " (buffer-name buffer)))
         (derived-mode-p 'text-mode))))

(seq-filter #'my-buffer-visble-and-text-p (buffer-list))
\end{verbatim}

与缓冲区一样，Emacs 窗口和 frame 也有它们自己的参数。我不会涵盖那些，因为它们的用途更为专门化，而且概念是相同的。只需知道它们是数据结构，你可以利用它们为你带来优势，包括遍历它们 (\hyperref[sec:org94bd4fd]{遍历列表元素})。
\section{文本自身具有属性}
\label{sec:orgea51fad}
正如像数据结构一样工作的缓冲区 (\hyperref[sec:orgc0d6740]{作为数据结构的缓冲区})，任何文本也可能有与其关联的属性。这是你可以使用 Emacs Lisp 来检查的元数据。例如，当你在某个编程缓冲区中看到语法高亮时，这就是文本属性的效果。某个函数负责“属性化（propertise）”或“字体化（fontify）”相关文本，并决定将一个称为“face”的对象应用于它。Face 是将排版和颜色属性捆绑在一起的构造，例如字体家族和字重，以及前景和背景色调。要获取一个包含光标处文本属性信息的帮助缓冲区，请键入 M-x (\texttt{execute-extended-command}) 然后调用命令 \textasciitilde{}describe-char\textasciitilde{}。它会告诉你它看到的字符、它是用什么字体渲染的、它是哪个代码点，以及它的文本属性是什么。

假设你正在编写你自己的主模式。在实验的早期阶段，你想手动将文本属性添加到缓冲区中所有出现的短语 \texttt{I have properties} 上，该缓冲区的主模式是 \textasciitilde{}fundamental-mode\textasciitilde{}，所以你可以这样做（\hyperref[sec:org5d051bd]{上次搜索的匹配数据}）：

\begin{verbatim}
(defun my-add-properties ()
  "Add properties to the text \"I have properties\" across the current buffer."
  (goto-char (point-min))
  (while (re-search-forward "I have properties" nil t)
    (add-text-properties (match-beginning 0) (match-end 0) '(face error))))
\end{verbatim}

实际尝试一下。使用 C-x b (\texttt{switch-to-buffer})，输入一些与现有缓冲区不匹配的随机字符，然后按 RET 访问该新缓冲区。它运行 \texttt{fundamental-mode\textasciitilde{}，意味着没有“字体化”发生，因此 \textasciitilde{}my-add-properties} 将按预期工作。现在粘贴以下内容：

\begin{verbatim}
This is some sample text. Will the phrase "I have properties" use the `bold' face?

What does it even mean for I have properties to be bold?
\end{verbatim}

继续使用 M-: (\texttt{eval-expression}) 并调用函数 \textasciitilde{}my-add-properties\textasciitilde{}。成功了吗？它应用的 face 叫做 \textasciitilde{}error\textasciitilde{}。忽略这个词的语义：我选择它仅仅是因为它通常以相当强烈和明显的方式进行样式化（尽管你当前的主题可能会有不同的做法）。

有一些函数可以查找给定缓冲区位置的属性，还有一些函数可以向前和向后搜索给定的属性。具体的细节现在并不重要。我只想让你记住，文本不仅仅是其组成的字符。要了解更多详情，请键入 M-x (\texttt{execute-extended-command}) 来调用命令 \textasciitilde{}shortdoc\textasciitilde{}。它会询问你一个文档组。选择 \texttt{text-properties} 以了解更多信息。嗯，对那里列出的所有内容都使用 \textasciitilde{}shortdoc\textasciitilde{}。我一直都这样做。
