技术文档/ELisp-Elements/elispelement-cn.org
* 符号、平衡表达式与引用
:PROPERTIES:
:CUSTOM_ID: h:symbols-balanced-expressions-and-quoting
:END:

#+cindex: Define a simple function 定义一个简单的函数
对于不熟悉 Emacs Lisp 的人来说，这是一种括号非常多的语言！这是一个简单的函数定义：

#+begin_src emacs-lisp
(defun my-greet-person (name)
  "Say hello to the person with NAME."
  (message "Hello %s" name))
#+end_src

#+findex: message
#+findex: view-echo-area-messages
我刚刚定义了一个名为 ~my-greet-person~ 的函数。它有一个参数列表，具体来说，是一个包含一个参数的列表，参数名为 =name=。然后是可选的文档字符串，供用户理解代码和/或函数的意图。~my-greet-person~ 接受 =name= 并将其作为参数传递给 ~message~ 函数，最终打印出问候语。~message~ 函数将文本记录在 =*Messages*= 缓冲区中，你可以使用 {{{kbd(C-h e)}}} (~view-echo-area-messages~) 直接访问该缓冲区。无论如何，以下是你如何用它期望的一个参数来调用 ~my-greet-person~：

#+begin_src emacs-lisp
(my-greet-person "Protesilaos")
#+end_src

现在用多个参数做同样的事情：

#+begin_src emacs-lisp
(defun my-greet-person-from-country (name country)
  "Say hello to the person with NAME who lives in COUNTRY."
  (message "Hello %s of %s" name country))
#+end_src

并这样调用它：

#+begin_src emacs-lisp
(my-greet-person-from-country "Protesilaos" "Cyprus")
#+end_src

即使对于最基本的任务，你也会用到很多括号。但不要害怕！这些实际上使结构化地理解你的代码变得更简单。如果现在感觉不是这样，那是因为你还不习惯。一旦你习惯了，就回不去了。

#+cindex: Lisp languages are all about lists Lisp 语言的核心是列表
任何 Lisp 方言（Emacs Lisp 是其中之一）的基本思想是，你有用来界定列表的括号。列表由元素组成。列表要么被求值以产生某些计算的结果，要么按原样返回以用于其他求值 ([[#h:side-effect-and-return-value][副作用与返回值]])：

- 列表作为函数调用 :: 当一个列表被求值时，第一个元素是函数名，其余元素是传递给该函数的参数。你已经在上面看到了这一点，我是如何用 ="Protesilaos"= 作为参数调用 ~my-greet-person~ 的。~my-greet-person-from-country~ 也是同样的原理，参数是 ="Protesilaos"= 和 ="Cyprus"=。

- 列表作为数据 :: 当一个列表不被求值时，它的任何元素在一开始都没有特殊含义。它们都作为一个列表原样返回，没有进一步的改变。当你不希望你的列表被求值时，你在它前面加上一个单引号字符。例如，='("Protesilaos" "Prot" "Cyprus")= 是一个包含三个元素的列表，应该按原样返回。

#+findex: car
#+findex: cdr
考虑后一种情况，你还没见过。你有一个元素列表，你想从中获取一些数据。在最基本的层面上，函数 ~car~ 和 ~cdr~ 分别返回第一个元素和所有剩余元素的列表：

#+begin_src emacs-lisp
(car '("Protesilaos" "Prot" "Cyprus"))
;; => "Protesilaos"

(cdr '("Protesilaos" "Prot" "Cyprus"))
;; => ("Prot" "Cyprus")
#+end_src

这里的单引号至关重要，因为它指示 Emacs 不要对列表求值。否则，对这个列表的求值会将第一个元素，即 ="Protesilaos"=，视为函数名，并将列表的其余部分视为该函数的参数。由于你没有定义这样的函数，你会得到一个错误。

#+findex: list
#+cindex: Self-evaluating objects 自求值对象
Emacs Lisp 中的某些数据类型是“自求值的”。这意味着如果你对它们求值，它们的返回值就是你已经看到的东西。例如，字符串 ="Protesilaos"= 的返回值是 ="Protesilaos"=。这对于字符串、数字、关键字、符号以及特殊的 ~nil~ 或 ~t~ 都成立。下面是一个包含这些类型示例的列表，你可以通过调用函数 ~list~ 来构建它：

#+begin_src emacs-lisp
(list "Protesilaos" 1 :hello 'my-greet-person-from-country nil t)
;; => ("Protesilaos" 1 :hello 'my-greet-person-from-country nil t)
#+end_src

~list~ 函数对其传递的参数进行求值，除非它们被引用。你得到没有明显变化的返回值的原因是自求值。注意 ~my-greet-person-from-country~ 的引用方式与我们引用一个不希望求值的列表的方式相同。如果没有它，~my-greet-person-from-country~ 将被求值，除非它也被定义为一个变量，否则将返回一个错误。

#+cindex: Quote to avoid evaluation 引用以避免求值
将单引号视为一个明确的指令：“不要对下面的内容求值”。更具体地说，它是一个指令，在通常会发生求值的情况下不执行求值 ([[#h:partial-evaluation-inside-of-a-list][列表内部的部分求值]])。换句话说，你不想在一个被引用的列表内部引用某些东西，因为那等同于对其引用两次：

#+begin_src emacs-lisp
;; This is the correct way:
'(1 :hello my-greet-person-from-country)

;; It is wrong to quote `my-greet-person-from-country' because the
;; entire list would not have been evaluated anyway.  The mistake here
;; is that you are quoting what is already quoted, like doing
;; ''my-greet-person-from-country.
'(1 :hello 'my-greet-person-from-country)
#+end_src

#+cindex: Self-quoting objects 自引用对象
#+cindex: Unquoted symbols are evaluated 未引用的符号会被求值
现在你可能想知道为什么我们引用了 ~my-greet-person-from-country~ 而没有引用其他东西？原因是你在那里看到的其他所有东西实际上都是“自引用的”，即自求值的另一面。而 ~my-greet-person-from-country~ 是一个符号。一个“符号”是对自身以外某物的引用：它要么表示某个计算——一个函数——要么表示一个变量的值。如果你写一个符号而不引用它，你实际上是在告诉 Emacs“给我这个符号所代表的值”。就 ~my-greet-person-from-country~ 而言，如果你尝试这样做会得到一个错误，因为这个符号不是一个变量，因此尝试从中获取值是行不通的。

#+concept: Elisp Macros Elisp 宏
请记住，Emacs Lisp 有一个“宏”的概念，它基本上是一个模板系统，用于编写实际扩展成其他代码然后被求值的代码。在一个宏内部，你控制引用的完成方式，这意味着前面提到的规则可能不适用于涉及宏的调用，即使它们仍然在宏的扩展形式内部使用 ([[#h:evaluation-inside-of-a-macro-or-special-form][宏或特殊形式内部的求值]])。

#+findex: quote
#+findex: function
随着你接触更多的 Emacs Lisp 代码，你会遇到前面带有井号的引号，例如 =#'some-symbol=。这个“锐引号”（sharp quote），正如它被称呼的那样，与常规引号相同，但增加了特指一个函数的语义。程序员因此可以更好地表达给定表达式的意图，而字节编译器可以在内部执行必要的检查和优化。有鉴于此，请阅读关于函数 ~quote~ 和 ~function~ 的内容，它们分别对应于常规引号和锐引号。

* 列表内部的部分求值
:PROPERTIES:
:CUSTOM_ID: h:partial-evaluation-inside-of-a-list
:END:

你已经对 Emacs Lisp 代码的样子有了一些概念 ([[#h:symbols-balanced-expressions-and-quoting][符号、平衡表达式与引用]])。你有一个列表，它要么被求值，要么按原样获取。还有另一种情况，即列表应该被部分求值，或者更具体地说，它应该被当作数据而不是函数调用，同时其中某些元素仍然需要被求值。

#+cindex: Declare a variable 声明一个变量
在下面的代码块中，我定义了一个名为 ~my-greeting-in-greek~ 的变量，这是一个希腊语中常用的短语，字面意思是“祝你健康”，发音为“yah sou”。为什么要用希腊语？好吧，你已经有了产生 Lisp 这一切的 ~lambda~，所以你不妨也了解其余的部分 ([[#h:when-to-use-a-named-function-or-a-lambda-function][何时使用命名函数或 lambda 函数]])！

#+begin_src emacs-lisp
(defvar my-greeting-in-greek "Γεια σου"
  "Basic greeting in Greek to wish health to somebody.")
#+end_src

#+findex: message
现在我想用 ~message~ 函数做些实验，以更好地理解求值是如何工作的。让我从引用列表，从而按原样获取它的场景开始：

#+begin_src emacs-lisp
(message "%S" '(one two my-greeting-in-greek four))
;;=> "(one two my-greeting-in-greek four)"
#+end_src

你会注意到变量 ~my-greeting-in-greek~ 没有被求值。我得到了符号，即实际的 ~my-greeting-in-greek~，而不是它所代表的值。这是预期的结果，因为整个列表都被引用了，因此，其中的所有内容都不会被求值。

现在检查下一个代码块，以理解我如何告诉 Emacs 我希望整个列表仍然被引用，但特别地让 ~my-greeting-in-greek~ 被求值，以便它被其值替换：

#+begin_src emacs-lisp
(message "%S" `(one two ,my-greeting-in-greek four))
;; => "(one two \"Γεια σου\" four)"
#+end_src

#+findex: concat
#+cindex: Quasi quote 准引用
#+cindex: Comma operator 逗号操作符
请密切注意这里的语法。我使用的是反引号或称后引号，而不是单引号，在我们的例子中，这也被称为“准引用”。它的行为类似于单引号，但前面带有逗号的任何内容除外。逗号是一个“对后面的东西求值”的指令，并且只在准引用的列表内部有效。后面跟着的“东西”要么是一个符号，要么是一个列表。列表当然可以是一个函数调用。那么让我使用 ~concat~ 来问候某个人，同时将所有内容作为一个列表返回：

#+begin_src emacs-lisp
(message "%S" `(one two ,(concat my-greeting-in-greek " " "Πρωτεσίλαε") four))
;; => "(one two \"Γεια σου Πρωτεσίλαε\" four)"
#+end_src

请记住，如果你根本不引用这个列表，你会得到一个错误，因为第一个元素 ~one~ 会被视为一个函数的符号，该函数将用所有其他元素作为其参数来调用。很可能 ~one~ 在你当前的 Emacs 会话中没有被定义为函数，或者那些参数对它来说无论如何都没有意义。此外，~two~ 和 ~four~ 随后会被视为变量，因为它们没有被引用，在这种情况下，那些变量也必须被定义，否则会导致更多错误。

#+cindex: Splicing in general Splicing（拼接）概述
除了逗号操作符，还有 =,@= （这到底怎么发音？也许是“comma at”？），这是“拼接（splicing）”的表示法。这是行话，用来替代说“返回值是一个列表，我希望你移除它最外层的括号”。实际上，原本会返回 ='(one two three)= 的代码现在返回 =one two three=。这种差异在孤立的情况下可能没有多大意义，但一旦你将这些元素视为应该独立工作的表达式，而不是仅仅作为被引用列表的元素时，它就有意义了。我不会在这里详细阐述一个例子，因为我认为这最好在定义宏的背景下进行介绍 ([[#h:evaluation-inside-of-a-macro-or-special-form][宏或特殊形式内部的求值]])。

你很可能不需要使用部分求值的知识。它在宏中更常见，但可以在任何地方应用。无论如何都要意识到它，因为在某些情况下，你至少需要理解你所依赖的某些代码正在做什么。

最后，既然我向你介绍了一些希腊语单词，我现在把你当作我的朋友了。这里有一个我小时候的笑话。我试图向我的英语老师解释某个事件。由于我缺乏表达自己的词汇，我开始使用希腊语单词。我的老师有一个严格的只用英语回应的政策，所以她说：“It is all Greek to me.”（对我来说都是希腊语）。我不知道她的回答是一个习语，意思是“我不明白你在说什么”，我轻率地回答说：“Yes, Greek madame; me no speak England very best.”（是的，希腊语，夫人；我英语说得不是最好）。我当时其实不是初学者，但我不会放过取笑这种情况的机会。就像你应该记得享受捣鼓 Emacs 的时光一样。但说够了！回到阅读这本书。

