技术文档/ELisp-Elements/elispelement-cn.org
* 宏或特殊形式内部的求值
:PROPERTIES:
:CUSTOM_ID: h:evaluation-inside-of-a-macro-or-special-form
:END:

在最基本的 Emacs Lisp 代码情况下，你有要么被求值要么不被求值的列表 ([[#h:symbols-balanced-expressions-and-quoting][符号、平衡表达式与引用]])。如果你玩得更花哨一点，你有只被部分求值的列表 ([[#h:partial-evaluation-inside-of-a-list][列表内部的部分求值]])。但有时，你看着一段代码，却无法理解为什么常规的引用和求值规则不适用。在你看到实际例子之前，先检查一个典型的函数调用，它也涉及一个变量的求值：

#+begin_src emacs-lisp
(concat my-greeting-in-greek " " "Πρωτεσίλαε")
#+end_src

#+findex: concat
#+cindex: Evaluation inside of a function call 函数调用内部的求值
你在关于部分求值的部分遇到过这段代码。你这里有一个对函数 ~concat~ 的调用，后面跟着三个参数。其中一个参数是一个变量，即 ~my-greeting-in-greek~。当这个列表被求值时，Emacs 实际做的是首先对参数（包括 ~my-greeting-in-greek~）进行求值，以获取它们各自的值，然后才用这些值调用 ~concat~。你可以将整个操作过程想象如下：

- 这里有一个列表。
- 它没有被引用。
- 所以你应该对它求值。
- 第一个元素是函数名。
- 剩余的元素是传递给该函数的参数。
- 检查参数是什么。
- 对每个参数求值，以将其解析为其真实值。
- 字符串是自求值的，而 ~my-greeting-in-greek~ 是一个变量。
- 你现在拥有了每个参数的值，包括符号 ~my-greeting-in-greek~ 的值。
- 用你得到的所有值调用 ~concat~。

换句话说，下面两个产生相同的结果（假设 ~my-greeting-in-greek~ 是常量）：

#+begin_src emacs-lisp
(concat my-greeting-in-greek " " "Πρωτεσίλαε")

(concat "Γεια σου" " " "Πρωτεσίλαε")
#+end_src

#+findex: setq
这是可预测的。它遵循单引号的基本逻辑：如果它被引用了，就不要对它求值并按原样返回，否则就对它求值并返回其值。但是你会发现很多情况下，这种预期的模式似乎没有被遵循。考虑这个使用 ~setq~ 将符号绑定到给定值的常见情况：

#+begin_src emacs-lisp
(setq my-test-symbol "Protesilaos of Cyprus")
#+end_src

上面的表达式看起来像一个函数调用，这意味着 (i) 列表没有被引用，(ii) 第一个元素是函数名，以及 (iii) 剩余的元素是传递给该函数的参数。在某种程度上，这都是正确的。不过你可能会期望 ~my-test-symbol~ 被当作一个变量，它会被原地求值以返回其结果，而这个结果反过来将是传递给函数的实际参数。然而，这并不是 ~setq~ 的工作方式。原因是它是一个特殊情况，内部执行的是这个：

#+begin_src emacs-lisp
(set 'my-test-symbol "Protesilaos of Cyprus")
#+end_src

#+findex: setq
#+findex: defun
在这里，事情就如预期了。幕后没有发生什么魔法。那么，~setq~ 是为了方便用户不必每次都引用符号。是的，这使得推理它变得有点困难，但你会习惯它，最终一切都会变得有意义。希望你会习惯这种特殊形式，就像你在 ~setq~ 以及 ~defun~ 等许多其他形式中发现的那样。这是一个你已经见过的函数：

#+begin_src emacs-lisp
(defun my-greet-person-from-country (name country)
  "Say hello to the person with NAME who lives in COUNTRY."
  (message "Hello %s of %s" name country))
#+end_src

如果常规的求值规则适用，那么参数列表应该被引用。否则，你会期望 =(name country)= 被解释为一个函数调用，其中 ~name~ 是函数符号，~country~ 是它的参数，而 ~country~ 本身也会是一个变量。但这并不是实际发生的情况，因为 ~defun~ 会在内部将该参数列表视为已被引用。

#+findex: let
另一个常见的场景是使用 ~let~ ([[#h:control-flow-with-if-let-and-friends][使用 ~if-let*~ 及其相关形式进行控制流]])。它的一般形式如下：

#+begin_src emacs-lisp
;; This is pseudo-code
(let LIST-OF-LISTS-AS-VARIABLE-BINDINGS
  BODY-OF-THE-FUNCTION)
#+end_src

=LIST-OF-LISTS-AS-VARIABLE-BINDINGS= 是一个列表，其中每个元素都是 =(SYMBOL VALUE)= 形式的列表。这里有一些实际的代码：

#+begin_src emacs-lisp
(let ((name "Protesilaos")
      (country "Cyprus"))
  (message "Hello %s of %s" name country))
#+end_src

继续特殊形式的主题，如果 ~let~ 是一个典型的函数调用，那么 =LIST-OF-LISTS-AS-VARIABLE-BINDINGS= 就必须被引用。否则，它会被求值，在这种情况下，第一个元素将是函数名。但这会返回一个错误，因为函数名将对应于另一个列表，即 =(name "Protesilaos")=，而不是一个符号。使用 ~let~ 时一切正常，因为它内部对其 =LIST-OF-LISTS-AS-VARIABLE-BINDINGS= 进行了引用。

#+findex: use-package
对于许多特殊形式以及宏，比如流行的 ~use-package~（用于在你的 Emacs 初始化文件中配置包），预期会有类似的行为。这些宏各自如何工作取决于它们的设计方式。我不会在这里深入探讨技术细节，因为我希望这本书能够长期有用，侧重于原则而不是可能随时间变化的实现细节。

#+findex: pp-macroexpand-last-sexp
#+cindex: Pretty print or expand a macro 漂亮打印或展开宏
要了解给定宏实际扩展成什么，请将光标放在其闭合括号的末尾，并调用命令 ~pp-macroexpand-last-sexp~。它将生成一个新的缓冲区，显示扩展后的 Emacs Lisp 代码。这才是实际替代宏被求值的内容。

#+findex: defmacro
#+vindex: default-directory
#+cindex: Defining macros 定义宏
#+cindex: Splicing within a macro 宏内部的拼接
有了这些基础，是时候编写一个宏了。这就像一个模板，使你能够避免重复自己。在语法上，宏很可能依赖于准引用、逗号操作符以及拼接机制的使用 ([[#h:partial-evaluation-inside-of-a-list][列表内部的部分求值]])。这里有一个简单的场景，我们希望在一个临时缓冲区中运行一些代码，同时将 ~default-directory~ 设置为用户的主目录。

#+begin_src emacs-lisp
(defmacro my-work-in-temp-buffer-from-home (&rest expressions)
  "Evaluate EXPRESSIONS in a temporary buffer with `default-directory' set to the user's home."
  `(let ((default-directory ,(expand-file-name "~/")))
     (with-temp-buffer
       (message "Running all expression from the `%s' directory" default-directory)
       ,@expressions)))
#+end_src

在这个定义中，=&rest= 使得后面的参数成为一个列表。所以你可以向它传递任意数量的参数，所有这些参数都将被收集到一个名为 =EXPRESSIONS= 的列表中。审慎使用部分求值确保了宏不会立即被求值，而只在被调用时才求值。传递给它的参数将被放置在你指定的位置。这是一个使用此宏的调用：

#+begin_src emacs-lisp
(progn
  (message "Now we are doing something unrelated to the macro")
  (my-work-in-temp-buffer-from-home
   (message "We do stuff inside the macro")
   (+ 1 1)
   (list "Protesilaos" "Cyprus")))
#+end_src

如果你将光标放在 ~my-work-in-temp-buffer-from-home~ 的闭合括号处，你可以通过键入 {{{kbd(M-x)}}} (~execute-extended-command~) 然后调用命令 ~pp-macroexpand-last-sexp~ 来确认它扩展成了什么。这是我得到的结果：

#+begin_src emacs-lisp
(let ((default-directory "/home/prot/"))
  (with-temp-buffer
    (message "Running all expression from the `%s' directory" default-directory)
    (message "We do stuff inside the macro")
    (+ 1 1)
    (list "Protesilaos" "Cyprus")))
#+end_src

将其与其上下文中的其余代码拼凑在一起，我得到这个：

#+begin_src emacs-lisp
(progn
  (message "Now we are doing something unrelated to the macro")
  (let ((default-directory "/home/prot/"))
    (with-temp-buffer
      (message "Running all expression from the `%s' directory" default-directory)
      (message "We do stuff inside the macro")
      (+ 1 1)
      (list "Protesilaos" "Cyprus"))))
#+end_src

记住这个例子，将 Elisp 宏视为一种表达方式：“这个小东西帮助我更简洁地表达这个更大的过程，而实际运行的代码仍然是后者的代码。”

我上面写的宏，其主体以准引用开始，所以你无法体会到其中求值的细微差别。让我向你展示另一种方法，我编写一个宏，让它可以定义几个几乎相同的交互式函数 ([[#h:make-your-interactive-function-also-work-from-lisp-calls][让你的交互式函数也能从 Lisp 调用中工作]])。

#+begin_src emacs-lisp
(defmacro my-define-command (name &rest expressions)
  "Define command with specifier NAME that evaluates EXPRESSIONS."
  (declare (indent 1))
  (unless (symbolp name)
    (error "I want NAME to be a symbol"))
  (let ((modifined-name (format "modified-version-of-%s" name)))
    `(defun ,(intern modifined-name) ()
       (interactive)
       ,(message "The difference between `%s' and `%s'" modifined-name name)
       ,@expressions)))
#+end_src

~my-define-command~ 大致可以分为两部分：(i) 直接求值的部分 和 (ii) 展开以供进一步求值的部分。后一部分以准引用开始。当调用宏时，这种区别很重要，因为前一部分会立即执行，所以如果我们遇到错误，它将永远不会展开然后运行 =EXPRESSIONS=。对下面的例子使用 ~pp-macroexpand-last-sexp~ 来看看我的意思。为方便起见，我在每种情况下面都包含了宏展开。

#+begin_src emacs-lisp
(my-define-command first-demo
  (message "This is what my function does")
  (+ 1 10)
  (message "And this"))
;; =>
;;
;; (defun modified-version-of-first-demo nil
;;   (interactive)
;;   "The difference between ‘modified-version-of-first-demo’ and ‘first-demo’"
;;   (message "This is what my function does")
;;   (+ 1 10)
;;   (message "And this"))


(my-define-command second-demo
  (list "Protesilaos" "Cyprus")
  (+ 1 1)
  (message "Arbitrary expressions here"))
;; =>
;;
;; (defun modified-version-of-second-demo nil
;;   (interactive)
;;   "The difference between ‘modified-version-of-second-demo’ and ‘second-demo’"
;;   (list "Protesilaos" "Cyprus")
;;   (+ 1 1)
;;   (message "Arbitrary expressions here"))


(my-define-command "error scenario"
  (list "Will" "Not" "Reach" "This")
  (/ 2 0))
;; => ERROR...
#+end_src

你需要宏吗？不总是需要，但有些情况下，一个定义良好的宏会使你的代码更优雅。重要的是你对求值如何工作有一个概念，这样你就不会被所有那些括号搞糊涂。否则，你可能会期望发生与实际得到的结果不同的事情。

