技术文档/ELisp-Elements/elispelement-cn.org
* 遍历列表元素
:PROPERTIES:
:CUSTOM_ID: h:mapping-through-a-list-of-elements
:END:

#+findex: while
#+findex: mapcar
#+findex: mapc
#+findex: dolist
#+findex: seq-filter
#+findex: seq-remove
编程中的一个常见例程是遍历一个项目列表并对每个项目执行一些计算。Emacs Lisp 有通用的 ~while~ 循环，以及一系列更专门用于遍历列表元素的函数，例如 ~mapcar~、~mapc~、~dolist~、~seq-filter~、~seq-remove~ 等等。根据你正在做的事情，你遍历元素的目的是产生一些副作用和/或测试返回值 ([[#h:side-effect-and-return-value][副作用与返回值]])。我将向你展示一些例子，让你决定哪种工具最适合手头的任务。

#+findex: mapcar
#+cindex: Accumulating results of a map 累积映射结果
从 ~mapcar~ 开始，它将一个函数应用于列表的每个元素。然后它获取每次迭代的返回值并将它们收集到一个新列表中。这就是 ~mapcar~ 整体的返回值。在下面的代码块中，我使用 ~mapcar~ 遍历一个数字列表，将它们增加 =10=，并返回一个包含增加后数字的新列表。

#+begin_src emacs-lisp
(mapcar
 (lambda (number)
   (+ 10 number))
 '(1 2 3 4 5))
;; => (11 12 13 14 15)
#+end_src

在上面的代码块中，我使用了一个 ~lambda~，即匿名函数 ([[#h:when-to-use-a-named-function-or-a-lambda-function][何时使用命名函数或 lambda 函数]])。下面是相同的代码，但使用了同名函数，即命名函数：

#+begin_src emacs-lisp
(defun my-increment-by-ten (number)
  "Add 10 to NUMBER."
  (+ 10 number))

(mapcar #'my-increment-by-ten '(1 2 3 4 5))
;; => (11 12 13 14 15)
#+end_src

注意这里我们引用了同名函数 ([[#h:symbols-balanced-expressions-and-quoting][符号、平衡表达式与引用]])。

#+findex: mapcar
#+findex: mapc
#+cindex: Mapping only for side effects 仅为副作用而映射
~mapcar~ 将返回值收集到一个新列表中。有时这是无用的。假设你想对一个保存所有访问文件的未保存缓冲区的函数求值。在这种情况下，你不在乎累积结果：你只想获得直接保存缓冲区的副作用。为此，你可以使用 ~mapc~，它总是返回它操作的列表：

#+begin_src emacs-lisp
(mapc
 (lambda (buffer)
   (when (and (buffer-file-name buffer)
              (buffer-modified-p buffer))
     (save-buffer)))
 (buffer-list))
#+end_src

#+findex: dolist
上述方法的替代方案是 ~dolist~，它用于产生副作用但总是返回 ~nil~：

#+begin_src emacs-lisp
(dolist (buffer (buffer-list))
  (when (and (buffer-file-name buffer)
             (buffer-modified-p buffer))
    (save-buffer)))
#+end_src

你会注意到 ~dolist~ 是一个宏，所以它的某些部分似乎与基本列表及其适用的求值规则表现不同 ([[#h:evaluation-inside-of-a-macro-or-special-form][宏或特殊形式内部的求值]])。这需要习惯代码的表达方式。

#+findex: dolist
#+findex: mapc
何时使用 ~dolist~ 而不是 ~mapc~ 是风格问题。如果你使用命名函数，在我看来 ~mapc~ 更简洁。否则 ~dolist~ 更容易阅读。这是我使用一些伪代码的方法：

#+begin_src emacs-lisp
;; I like this:
(mapc #'NAMED-FUNCTION LIST)

;; I also like a `dolist' instead of a `mapc' with a `lambda':
(dolist (element LIST)
  (OPERATE-ON element))

;; I do not like this:
(mapc
 (lambda (element)
   (OPERATE-ON element))
 LIST)
#+end_src

虽然 ~dolist~ 和 ~mapc~ 是为了副作用，但你仍然可以在 ~let~ 和相关形式的帮助下，利用它们来累积结果 ([[#h:control-flow-with-if-let-and-friends][使用 ~if-let*~ 及其相关形式进行控制流]])。根据具体情况，这种方法可能比依赖 ~mapcar~ 更有意义。这是一个带注释的草图：

#+begin_src emacs-lisp
;; Start with an empty list of `found-strings'.
(let ((found-strings nil))
  ;; Use `dolist' to test each element of the list '("Protesilaos" 1 2 3 "Cyprus").
  (dolist (element '("Protesilaos" 1 2 3 "Cyprus"))
    ;; If the element is a string, then `push' it to the `found-strings', else skip it.
    (when (stringp element)
      (push element found-strings)))
  ;; Now that we are done with the `dolist', return the new value of `found-strings'.
  found-strings)
;; => ("Cyprus" "Protesilaos")


;; As above but reverse the return value, which makes more sense:
(let ((found-strings nil))
  (dolist (element '("Protesilaos" 1 2 3 "Cyprus"))
    (when (stringp element)
      (push element found-strings)))
  (nreverse found-strings))
;; => ("Protesilaos" "Cyprus")
#+end_src

为了完整起见，前面的例子如果使用 ~mapcar~ 将必须这样做：

#+begin_src emacs-lisp
(mapcar
 (lambda (element)
   (when (stringp element)
     element))
 '("Protesilaos" 1 2 3 "Cyprus"))
;; => ("Protesilaos" nil nil nil "Cyprus")


(delq nil
      (mapcar
       (lambda (element)
         (when (stringp element)
           element))
       '("Protesilaos" 1 2 3 "Cyprus")))
;; => ("Protesilaos" "Cyprus")
#+end_src

因为 ~mapcar~ 会愉快地累积所有的返回值，它返回一个包含 ~nil~ 的列表。如果你想要那样，你可能甚至不会费心在那里使用 ~when~ 子句。因此，~delq~ 被应用于 ~mapcar~ 的返回值，以删除所有 ~nil~ 的实例。现在将这项繁琐的工作与 ~seq-filter~ 进行比较：

#+begin_src emacs-lisp
(seq-filter #'stringp '("Protesilaos" 1 2 3 "Cyprus"))
;; => ("Protesilaos" "Cyprus")
#+end_src

当 你只需要测试元素是否满足谓词函数然后返回该元素时，~seq-filter~ 是最佳工具。但你不能返回其他东西。而 ~mapcar~ 会毫无怨言地接受任何返回值，例如以下：

#+begin_src emacs-lisp
(delq nil
      (mapcar
       (lambda (element)
         (when (stringp element)
           ;; `mapcar' accumulates any return value, so we can change
           ;; the element to generate the results we need.
           (upcase element)))
       '("Protesilaos" 1 2 3 "Cyprus")))
;; => ("PROTESILAOS" "CYPRUS")

(seq-filter
 (lambda (element)
   (when (stringp element)
     ;; `seq-filter' only returns elements that have a non-nil return
     ;; value here, but it returns the elements, not what we return
     ;; here.  In other words, this `lambda' does unnecessary work.
     (upcase element)))
 '("Protesilaos" 1 2 3 "Cyprus"))
;; => ("Protesilaos" "Cyprus")
#+end_src

#+findex: find-library
#+findex: seq-take
#+findex: seq-find
#+findex: seq-union
#+cindex: Visit the source code of a file 访问文件的源代码
#+cindex: Shortdoc for lists and sequences 列表和序列的 Shortdoc
你如何遍历列表元素将取决于你想要做什么。没有一个单一的函数能为你做所有事情。理解细微差别，你就可以开始了。哦，还有，一定要看看内置的 ~seq~ 库（使用 {{{kbd(M-x)}}} (~execute-extended-command~)，调用 ~find-library~，然后搜索 ~seq~）。你现在正在查看 =seq.el= 的源代码：它定义了许多函数，如 ~seq-take~、~seq-find~、~seq-union~。另一种方法是调用命令 ~shortdoc~ 并阅读关于文档组 =list= 以及 =sequence= 的内容。

