技术文档/ELisp-Elements/elispelement-cn.org
* 上次搜索的匹配数据
:PROPERTIES:
:CUSTOM_ID: h:the-match-data-of-the-last-search
:END:

#+findex: match-data
#+findex: match-beginning
#+findex: match-string
#+findex: re-search-forward
#+findex: looking-at
#+findex: string-match
当你使用 Emacs Lisp 时，你会遇到“匹配数据（match data）”的概念以及伴随的函数 ~match-data~、~match-beginning~、~match-string~ 等等。这些指的是上次搜索的结果，通常由函数 ~re-search-forward~、~looking-at~、~string-match~ 及相关函数执行。每次你执行搜索时，匹配数据都会更新。请注意这个常见的副作用 ([[#h:side-effect-and-return-value][副作用与返回值]])。如果你忘记了它，你的代码很可能不会做正确的事情。

在下面的代码块中，我定义了一个函数，它在当前缓冲区中执行搜索，并返回一个不带文本属性（如果相关）的匹配数据列表 ([[#h:text-has-its-own-properties][文本自身具有属性]])。

#+begin_src emacs-lisp
(defun my-get-match-data (regexp)
  "Search forward for REGEXP and return its match data, else nil."
  (when (re-search-forward regexp nil t)
    (list
     :beginning (match-beginning 0)
     :end (match-end 0)
     :string (match-string-no-properties 0))))
#+end_src

然后你可以用一个字符串参数来调用它，该参数表示一个 Emacs Lisp 正则表达式：

#+begin_src emacs-lisp
(my-get-match-data "Protesilaos.*Cyprus")
#+end_src

如果正则表达式匹配，那么你会得到匹配数据。这是一些示例文本：

#+begin_src fundamental
Protesilaos lives in the mountains of Cyprus.
#+end_src

将光标放在该文本之前，并使用 {{{kbd(M-:)}}} (~eval-expression~) 来求值带有我上面显示的 regexp 的 ~my-get-match-data~。你会得到一个返回值，正如预期的那样。

#+findex: save-excursion
#+findex: point
按照 ~my-get-match-data~ 的编写方式，它做了两件事：(i) 它具有将光标移动到找到的文本末尾的副作用，以及 (ii) 它返回一个包含我指定的匹配数据的列表。在许多情况下，你不希望有前面提到的副作用：光标应该停留在原来的位置。因此，你可以将你的代码包装在 ~save-excursion~ 中 ([[#h:switching-to-another-buffer-window-or-narrowed-state][切换到另一个缓冲区、窗口或 narrowed 状态]])：它会做它必须做的事情，并最终恢复 ~point~ ([[#h:run-some-code-or-fall-back-to-some-other-code][运行一些代码或回退到其他代码]])：

#+begin_src emacs-lisp
(defun my-get-match-data (regexp)
  "Search forward for REGEXP and return its match data, else nil."
  (save-excursion ; we wrap our code in a `save-excursion' to inhibit the side effect
    (when (re-search-forward regexp nil t)
      (list
       :beginning (match-beginning 0)
       :end (match-end 0)
       :string (match-string-no-properties 0)))))
#+end_src

#+findex: save-match-data
#+cindex: Preserve the last match data 保留上次的匹配数据
如果你对这个版本的 ~my-get-match-data~ 求值，然后重试我上面的函数调用，你会注意到你是如何得到预期的返回值，而没有光标移动到匹配文本末尾的副作用。在实践中，这是一个有用的工具，可以与 ~save-match-data~ 结合使用。想象一下，你想在你正在执行的另一次搜索内部进行一次向前搜索，例如仅仅测试上下文中是否存在某个正则表达式的匹配，但需要抑制对你计划操作的匹配数据的修改。因此：

#+begin_src emacs-lisp
(defun my-get-match-data-with-extra-check (regexp)
  "Search forward for REGEXP followed by no spaces and return its match data, else nil."
  (save-excursion
    (when (and (re-search-forward regexp nil t)
               (save-match-data (not (looking-at "[\s\t]+"))))
      ;; Return the match data of the first search.  The second one
      ;; which tests for spaces or tabs is just an extra check, but we
      ;; do not want to use its match data, hence the `save-match-data'
      ;; around it.
      (list
       :beginning (match-beginning 0)
       :end (match-end 0)
       :string (match-string-no-properties 0)))))
#+end_src

对函数 ~my-get-match-data-with-extra-check~ 求值，然后用 {{{kbd(M-:)}}} (~eval-expression~) 调用它来测试，它在下面的第二个例子中返回一个非 ~nil~ 值，但在第一个例子中不返回。这是预期的结果。

#+begin_src emacs-lisp
(my-get-match-data-with-extra-check "Protesilaos.*Cyprus")
;; => nil


;; Protesilaos, also known as "Prot", lives in the mountains of Cyprus   .

(my-get-match-data-with-extra-check "Protesilaos.*Cyprus")
;; => (:beginning 41988 :end 42032 :string "Protesilaos lives in the mountains of Cyprus")


;; Protesilaos lives in the mountains of Cyprus.
#+end_src

* 切换到另一个缓冲区、窗口或 narrowed 状态
:PROPERTIES:
:CUSTOM_ID: h:switching-to-another-buffer-window-or-narrowed-state
:END:

当你使用 Emacs Lisp 以编程方式做事时，你会遇到需要离开当前位置的情况。你可能需要切换到另一个缓冲区，切换到给定缓冲区的窗口，甚至修改你正在编辑的缓冲区中可见的内容。在任何时候，这都涉及一个或多个副作用，这些副作用很可能应该在你的函数完成其工作时被撤销 ([[#h:side-effect-and-return-value][副作用与返回值]])。

#+findex: point
#+findex: save-excursion
#+cindex: Restore the point 恢复点位
也许最常见的情况是恢复 ~point~。你有一些代码在缓冲区中向后或向前移动以执行对给定文本片段的匹配。但是之后，你需要将光标留在它原来的位置，否则用户会失去方向感。将你的代码包装在 ~save-excursion~ 中，你就搞定了，正如我在别处展示的那样 ([[#h:the-match-data-of-the-last-search][上次搜索的匹配数据]])：

#+begin_src emacs-lisp
(save-excursion ; restore the `point' after you are done
  MOVE-AROUND-IN-THIS-BUFFER)
#+end_src

#+findex: save-window-excursion
#+findex: select-window
#+cindex: Restore the selected window 恢复所选窗口
~save-window-excursion~ 的原理相同，它允许你选择另一个窗口（例如使用 ~select-window~），在其缓冲区中移动，然后恢复窗口的原状：

#+begin_src emacs-lisp
(save-window-excursion
  (select-window SOME-WINDOW)
  MOVE-AROUND-IN-THIS-BUFFER)
#+end_src

#+findex: save-restriction
#+findex: widen
#+findex: narrow-to-region
#+findex: org-narrow-to-subtree
#+cindex: Restore the narrowing state 恢复 narrowing 状态
~save-restriction~ 允许你恢复缓冲区的当前 narrowing 状态。然后你可以选择要么 ~widen~ 要么 ~narrow-to-region~（以及像 ~org-narrow-to-subtree~ 这样的相关命令），做你必须做的事情，然后将缓冲区恢复到其原始状态。

#+begin_src emacs-lisp
;; Here we assume that we start in a widened state.  Then we narrow to
;; the current Org heading to get all of its contents as one massive
;; string.  Then we widen again, courtesy of `save-restriction'.
(save-restriction
  (org-narrow-to-subtree)
  (buffer-string))
#+end_src

根据具体情况，你可能需要组合使用上述方法。请注意 ~save-restriction~ 的文档告诉你将 ~save-excursion~ 作为最外层的调用。除此之外，你还会发现一些情况需要不同的方法来执行某些条件行为 ([[#h:run-some-code-or-fall-back-to-some-other-code][运行一些代码或回退到其他代码]])。

