技术文档/ELisp-Elements/elispelement-cn.org
* 使用 ~if~、~cond~ 等进行基本控制流
:PROPERTIES:
:CUSTOM_ID: h:basic-control-flow-with-if-cond-and-others
:END:

#+findex: defun
#+findex: forward-line
你不需要任何条件逻辑来执行基本操作。例如，如果你编写一个向下移动 15 行的命令，当它无法移动超过你指定的数量时，它自然会在缓冲区末尾停止。使用 ~defun~，你编写一个交互式函数（即一个“命令”）来无条件地使用 ~forward-line~ 向下移动 15 行（用负数调用它以向相反方向移动）：

#+begin_src emacs-lisp
(defun my-15-lines-down ()
  "Move at most 15 lines down."
  (interactive)
  (forward-line 15))
#+end_src

#+findex: if
#+findex: when
#+findex: unless
#+findex: cond
#+findex: and
#+findex: or
#+cindex: Control flow 控制流
~my-15-lines-down~ 几乎是最简单的：它包装了一个基本函数，并向其传递一个固定的参数，本例中是数字 =15=。使用 {{{kbd(M-x)}}} (~execute-extended-command~) 然后按名称调用此命令。它有效！一旦你决定仅在满足给定条件时才执行某些操作，事情就会变得更加复杂。这种逻辑序列不同分支之间的“控制流”是用 ~if~、~when~、~unless~ 和 ~cond~ 等来表达的。根据具体情况，~and~ 以及 ~or~ 可能就足够了。

#+findex: eobp
#+findex: string-match-p
#+findex: stringp
#+cindex: Predicate functions 谓词函数
让你的 ~my-15-lines-down~ 变得更聪明一点怎么样？当它处于缓冲区的绝对末尾时，让它向上移动 15 行。为什么？因为这是一个演示，所以为什么不呢？测试点位是否在缓冲区末尾的谓词函数是 ~eobp~。一个“谓词”是一个函数，当其条件满足时返回 true（技术上是非 ~nil~），否则返回 ~nil~ ([[#h:side-effect-and-return-value][副作用与返回值]])。至于这个奇怪的名字，Emacs Lisp 中的惯例是以 =p= 后缀结束谓词函数：如果函数名由多个单词组成（通常用破折号分隔），则谓词函数命名为 =NAME-p=，例如 ~string-match-p~；否则命名为 =NAMEp=，例如 ~stringp~。

#+begin_src emacs-lisp
(defun my-15-lines-down-or-up ()
  "Move at most 15 lines down or go back if `eobp' is non-nil."
  (interactive)
  (if (eobp)
      (forward-line -15)
    (forward-line 15)))
#+end_src

对这个函数求值，然后键入 {{{kbd(M-x)}}} (~execute-extended-command~) 并调用 ~my-15-lines-down-or-up~ 来感受一下。下面是一个类似的想法，如果 ~eobp~ 返回非 ~nil~，它会抛出错误并退出正在做的事情：

#+begin_src emacs-lisp
(defun my-15-lines-down-or-error ()
  "Throw an error if `eobp' returns non-nil, else move 15 lines down."
  (interactive)
  (if (eobp)
      (error "Already at the end; will not move further")
    (forward-line 15)))
#+end_src

#+cindex: Indentation in Emacs Lisp Emacs Lisp 中的缩进
Emacs Lisp 的一个怪癖（或许一直以来都是一个特性）是它的缩进方式。只需标记你写好的代码并键入 {{{kbd(TAB)}}}: Emacs 会负责按照应有的方式对其进行缩进。在 ~if~ 语句的情况下，“then”部分比逻辑的“else”部分缩进得更深。这种缩进没有特殊含义：你可以把所有东西写在一行上，比如 =(if COND THIS ELSE)=，顺便说一下，这看起来就像你典型的列表 ([[#h:symbols-balanced-expressions-and-quoting][符号、平衡表达式与引用]])。缩进的作用是帮助你识别括号的不平衡。如果不同的表达式都以看起来奇怪的方式对齐，那么你很可能缺少一个括号或括号太多了。通常，同一级别的表达式都会以相同的方式对齐。更深层次的表达式会有更多的缩进，依此类推。经验会让你能够发现括号不匹配的错误。但即使你没有识别出来，你最终也会得到一个错误。请放心！

~if~ 的写法就像一个接受两个或更多参数的函数。“或更多”的部分都算作“else”逻辑的一部分。因此，=(if COND THIS)= 没有“else”后果，而 =(if COND THIS ELSE1 ELSE2 ELSE3)= 将按顺序运行 =ELSE1=、=ELSE2= 和 =ELSE3= 作为“else”分支的一部分。当你考虑到适当的缩进时，它看起来是这样的：

#+begin_src emacs-lisp
(if COND
    THIS
  ELSE1
  ELSE2
  ELSE3)
#+end_src

#+findex: progn
那么如果 =THIS= 部分需要多于一个函数调用呢？Elisp 有 ~progn~ 形式，你可以用它来包装函数调用并将它们作为一个单一参数传递。把它们放在一起，你的代码现在会像这样：

#+begin_src emacs-lisp
(if COND
    (progn
      THIS1
      THIS2
      THIS3)
  ELSE1
  ELSE2
  ELSE3)
#+end_src

#+findex: when
如果你不需要“else”部分，使用 ~when~ 来表达你的意图。在内部，这是一个宏，实际上代表 =(if COND (progn EXPRESSIONS))=，其中 =EXPRESSIONS= 是一个或多个表达式。一个 ~when~ 看起来像这样：

#+begin_src emacs-lisp
(when COND
  THIS1
  THIS2
  THIS3)
#+end_src

#+findex: unless
类似地，~unless~ 的意思是 =(when (not COND) EXPRESSIONS)=。它也是一个宏，扩展为一个 ~if~ 语句：

#+begin_src emacs-lisp
(unless COND
  THIS1
  THIS2
  THIS3)
#+end_src

#+findex: and
#+findex: or
当你测试的条件有多个部分时，你可以依赖 ~and~ 以及 ~or~：

#+begin_src emacs-lisp
(when (or THIS THAT)
  EXPRESSIONS)

(when (and THIS THAT)
  EXPRESSIONS)

(when (or (and THIS THAT) OTHER)
  EXPRESSIONS)
#+end_src

#+findex: if
#+findex: when
#+findex: or
#+findex: and
#+findex: cond
根据具体情况，多个 ~if~、~when~、~or~、~and~ 的组合会看起来很别扭。你可以使用 ~cond~ 将逻辑分解为不同的条件，这些条件从上到下依次测试。~cond~ 的写法是一个列表的列表，这些列表不需要引用 ([[#h:evaluation-inside-of-a-macro-or-special-form][宏或特殊形式内部的求值]])。抽象地说，它看起来像这样：

#+begin_src emacs-lisp
(cond
 (CONDITION1
  CONSEQUENCES1)
 (CONDITION2
  CONSEQUENCES2)
 (CONDITION3
  CONSEQUENCES3)
 (t
  CONSEQUENCES-FALLBACK))
#+end_src

每个后果可以是任意数量的表达式，就像你上面看到的 ~when~ 一样。这是一个展示 ~cond~ 行为的玩具函数：

#+begin_src emacs-lisp
(defun my-toy-cond (argument)
  "Return a response depending on the type of ARGUMENT."
  (cond
   ((and (stringp argument)
         (string-blank-p argument))
    (message "You just gave me a blank string; try harder!"))
   ((stringp argument)
    (message "I see you can do non-blanks string; I call that progress."))
   ((null argument)
    (message "Yes, the nil is an empty list like (), but do not worry about it"))
   ((listp argument)
    (message "Oh, I see you are in the flow of using lists!"))
   ((symbolp argument)
    (message "What's up with the symbols, mate?"))
   ((natnump argument)
    (message "I fancy those natural numbers!"))
   ((numberp argument)
    (message "You might as well be a math prodigy!"))
   (t
    (message "I have no idea what type of thing your argument `%s' is" argument))))
#+end_src

我希望你对其求值并传递不同的参数来测试它做了什么 ([[#h:evaluate-emacs-lisp][求值 Emacs Lisp]])。这里有两个例子：

#+begin_src emacs-lisp
(my-toy-cond "")
;; => "You just gave me a blank string; try harder!"

(my-toy-cond '(1 2 3))
;; => "Oh, I see you are in the flow of using lists!"
#+end_src

以上所有在 Emacs Lisp 中都很常见。另一个强大的宏是 ~pcase~，由于其特殊性，我们将单独考虑它 ([[#h:pattern-match-with-pcase-and-related][使用 ~pcase~ 及相关形式进行模式匹配]])。

* 使用 ~if-let*~ 及其相关形式进行控制流
:PROPERTIES:
:CUSTOM_ID: h:control-flow-with-if-let-and-friends
:END:

#+findex: let
#+findex: let*
#+cindex: Let bind variables in the current scope 在当前作用域内 let 绑定变量
~let~ 和 ~let*~ 声明仅在当前作用域内（即 ~let~ 的 =BODY= 部分）可用的变量。因此：

#+begin_src emacs-lisp
(let BINDINGS
  BODY)

(let ((variable1 value1)
      (variable2 value2))
  BODY)
#+end_src

=BINDINGS= 是一个列表的列表，不需要被引用 ([[#h:evaluation-inside-of-a-macro-or-special-form][宏或特殊形式内部的求值]])。而 =BODY= 由一个或多个表达式组成，我在本书的其他地方也将其命名为 =EXPRESSIONS=。~let~ 和 ~let*~（读作“let star”）的区别在于，后者使较早的绑定可用于较晚的绑定。像这样：

#+begin_src emacs-lisp
;; This works because `greeting' can access `name' and `country',
;; courtesy of `let*':
(let* ((name "Protesilaos")
       (country "Cyprus")
       (greeting (format "Hello %s of %s" name country)))
  (DO-STUFF-WITH greeting))

;; But this fails...
(let ((name "Protesilaos")
      (country "Cyprus")
      (greeting (format "Hello %s of %s" name country)))
  (DO-STUFF-WITH greeting))
#+end_src

有时你想要做的是，当且仅当这些绑定都非 ~nil~ 时才创建它们。如果它们的值是 ~nil~，那么它们对你来说是无用的，在这种情况下你会做别的事情 ([[#h:basic-control-flow-with-if-cond-and-others][使用 ~if~、~cond~ 等进行基本控制流]])。当你使用函数调用或某个其他变量的返回值创建绑定时，值可能是 ~nil~ 也可能不是。你总是可以编写这样的代码：

#+begin_src emacs-lisp
(let ((variable1 (SOME-FUNCTION SOME-ARGUMENT))
      (variable2 (OTHER-FUNCTION OTHER-ARGUMENT)))
  (if (and variable1 variable2) ; simply test both for non-nil
      THIS
    ELSE))
#+end_src

#+findex: if-let*
但是你可以用 ~if-let*~ 做同样的事情，其中 =THIS= 部分仅在所有绑定都非 ~nil~ 时运行：

#+begin_src emacs-lisp
(if-let* ((variable1 (SOME-FUNCTION SOME-ARGUMENT))
          (variable2 (OTHER-FUNCTION OTHER-ARGUMENT)))
    THIS
  ELSE)
#+end_src

在 =ELSE= 部分，绑定 ~variable1~ 和 ~variable2~ 不存在：它们只存在于代码的 =THIS= 部分。

#+findex: when-let*
~when-let*~ 与 ~when~ 相同，意味着它没有“else”逻辑。如果它的某个绑定是 ~nil~，那么整个 ~when-let*~ 返回 ~nil~。无需赘述这一点。

随着你深入研究 Emacs Lisp 生态系统，你会遇到 ~if-let*~ 的用法，它 (i) 像 ~let~ 或 ~let*~ 一样创建多个绑定，但 (ii) 也调用一个谓词函数来测试它们是否应该继续执行逻辑的 =THIS= 部分。记住，如果 ~if-let*~ 的某个绑定返回 ~nil~，它会直接转到 =ELSE=。考虑这个例子：

#+begin_src emacs-lisp
(if-let* ((variable1 (SOME-FUNCTION SOME-ARGUMENT))
          ;; The _ signifies intent: "do not bind this; I only care
          ;; about the return value being non-nil".  What we are doing
          ;; here is test if `variable1' is a string: if it is, we
          ;; continue with the bindings, otherwise we move to the ELSE
          ;; part of the code.
          (_ (string-match-p variable1))
          (variable2 (OTHER-FUNCTION OTHER-ARGUMENT)))
    THIS
  ELSE)
#+end_src

没有天生优越的做事方式。关键在于为手头的任务使用正确的工具。有时你希望创建绑定，即使它们的值是 ~nil~。选择有意义的方式。

