技术文档/ELisp-Elements/elispelement-cn.org
* 使用 ~pcase~ 及相关形式进行模式匹配
:PROPERTIES:
:CUSTOM_ID: h:pattern-match-with-pcase-and-related
:END:

#+findex: pcase
#+vindex: major-mode
一旦你掌握了用 Emacs Lisp 表达思想的流程，你将能熟练使用 ~if~、~cond~ 及类似形式 ([[#h:basic-control-flow-with-if-cond-and-others][使用 ~if~、~cond~ 等进行基本控制流]])。如果使用 ~if-let*~，你甚至可能玩得更花哨 ([[#h:control-flow-with-if-let-and-friends][使用 ~if-let*~ 及其相关形式进行控制流]])。然而，无论你怎么做，有些情况下，更简洁的表达方式无疑更有益。这就是 ~pcase~ 发挥作用的地方。在其最基本的表述中，它类似于 ~cond~，因为它测试给定表达式的返回值与一系列条件的匹配情况。这里有一个例子，将变量 ~major-mode~ 的缓冲区局部值与几个已知的符号进行相等性比较：

#+begin_src emacs-lisp
(pcase major-mode
  ('org-mode (message "You are in Org"))
  ('emacs-lisp-mode (message "You are in Emacs Lisp"))
  (_ (message "You are somewhere else")))
#+end_src

以上与这个 ~cond~ 的想法相同：

#+begin_src emacs-lisp
(cond
 ((eq major-mode 'org-mode)
  (message "You are in Org"))
 ((eq major-mode 'emacs-lisp-mode)
  (message "You are in Emacs Lisp"))
 (t
  (message "You are somewhere else")))
#+end_src

#+findex: pcase
#+findex: message
一些程序员可能会争辩说 ~pcase~ 更优雅。我认为在这个具体的例子中确实如此，但我保持灵活和务实：我会使用任何对我正在编写的代码更有意义的方式。谈到优雅，我应该告诉你，几乎所有的条件逻辑都可以用一种看似意想不到的方式来完成。考虑一下我在本书中的例子是如何重复使用 ~message~ 的，而实际上唯一改变的部分是传递给该函数的实际字符串/参数。这样做同样有效：

#+begin_src emacs-lisp
(message
 (pcase major-mode
   ('org-mode "You are in Org")
   ('emacs-lisp-mode "You are in Emacs Lisp")
   (_ "You are somewhere else")))
#+end_src

对于 ~if~、~when~ 和其余的也是同样的想法。

#+cindex: Domain-Specific Language (DSL) 领域特定语言（DSL）
回到 ~pcase~ 有何不同的主题。如果你阅读它的文档，你会意识到它有自己的迷你语言，或称“领域特定语言”（DSL）。这对于宏来说很常见 ([[#h:evaluation-inside-of-a-macro-or-special-form][宏或特殊形式内部的求值]])。它们定义了求值如何完成以及哪种表达式被特殊处理。那么让我送你这个玩具函数，它说明了现在正在讨论的 DSL 的一些主要特性：

#+begin_src emacs-lisp
(defun my-toy-pcase (argument)
  "Use `pcase' to return an appropriate response for ARGUMENT."
  (pcase argument
    (`(,one ,_ ,three)
     (message "List where first element is `%s', second is ignored, third is `%s'" one three))
    (`(,one . ,two)
     (message "Cons cell where first element is `%s' and second is `%s'" one two))
    ((pred stringp)
     (message "The argument is a string of some sort"))
    ('hello
     (message "The argument is equal to the symbol `hello'"))
    (_ (message "This is the fallback"))))
#+end_src

去对那个函数求值，然后试用一下 ([[#h:evaluate-emacs-lisp][求值 Emacs Lisp]])。下面是几个例子：

#+begin_src emacs-lisp
(my-toy-pcase '("Protesilaos" "of" "Cyprus"))
;; => "List where first element is ‘Protesilaos’, second is ignored, third is ‘Cyprus’"

(my-toy-pcase '("Protesilaos" . "Cyprus"))
;; => "Cons cell where first element is ‘Protesilaos’ and second is ‘Cyprus’"
#+end_src

#+findex: pcase-let
#+findex: pcase-let*
#+findex: pcase-lambda
#+findex: pcase-dolist
#+findex: let
#+findex: let*
#+findex: lambda
#+findex: dolist
#+cindex: Destructuring 解构
其中一些子句是表达 ~cond~ 的不同方式。可以说更好，但在我看来并非明显的赢家。令人印象深刻且真正带来范式转变的是“解构（destructuring）”的概念，即对表达式进行的模式匹配，它有效地将列表或 cons cell 的元素通过 ~let~ 绑定到它们对应的索引。用于这种解构的语法是晦涩难懂的，直到你将其与用于部分求值的准引用和逗号联系起来 ([[#h:partial-evaluation-inside-of-a-list][列表内部的部分求值]])。考虑到这一点，将 ~pcase-let~、~pcase-let*~、~pcase-lambda~ 和 ~pcase-dolist~ 视为普通的 ~let~、~let*~、~lambda~ 和 ~dolist~ 的变体，增加了支持解构的特性。不过，它们并没有做 ~pcase~ 的任何额外功能——只是在它们熟悉的行为之上增加了析构！这在你处理函数返回值为列表时特别有用。我不会详细阐述，因为这是一个高级用例。如果你已经达到那个水平，你不需要我告诉你该写什么。对于我们其余的人，像我一样，通常处理更简单的代码，~pcase-let~ 足以说明这个原则：

#+begin_src emacs-lisp
(defun my-split-string-at-space (string)
  "Split STRING at the space, returning a list of strings."
  (split-string string "\s"))

(pcase-let ((`(,one ,_ ,three) (my-split-string-at-space "Protesilaos of Cyprus")))
  (message "This is like `let', but we got `%s' and `%s' via destructuring" one three))
;; => "This is like ‘let’, but we got ‘Protesilaos’ and ‘Cyprus’ via destructuring"
#+end_src

你是否使用 ~pcase~ 和一般的解构取决于你。你不需要它们来编写高质量的代码。不过，你可能会同意那些认为它们本质上更优雅的人的观点，并因此选择使用它们来使代码简洁而富有表现力。

