技术文档/ELisp-Elements/elispelement-cn.tex
\section{运行一些代码或回退到其他代码}
\label{sec:org16c56bc}
你典型的代码将依赖 \texttt{if\textasciitilde{}、\textasciitilde{}cond} 等进行控制流 (\hyperref[sec:org9ad3ad6]{使用 \texttt{if\textasciitilde{}、\textasciitilde{}cond} 等进行基本控制流})。根据你的具体需求或风格考虑，它甚至可能包括 \texttt{pcase} (\hyperref[sec:org6c9b23a]{使用 \texttt{pcase} 及相关形式进行模式匹配}) 以及 \texttt{if-let*} (\hyperref[sec:org795b8c4]{使用 \texttt{if-let*} 及其相关形式进行控制流})。然而，有些情况下，你必须在主要操作结束或退出后运行额外的代码。其思想是清理你创建的任何中间状态。逻辑是“用所有必要的副作用做这件事，然后无论发生什么，现在也做那件事，以便（除其他外）撤销副作用。” 这是“回溯保护（unwinding）”的概念，通过 \texttt{unwind-protect} 实现。

在下面的代码块中，我定义了一个函数，它会产生一个 minibuffer 提示，要求你提供 \texttt{y} 或 \texttt{n} 的答案，这是“是”或“否”的简写表示法。它测试 \texttt{y-or-n-p} 的返回值来决定需要做什么。当提示符打开时，该函数会高亮显示当前缓冲区中正则表达式 \texttt{(defun} 的所有实例。在你完成 minibuffer 及其后果后，这些高亮必须消失。

\begin{verbatim}
(defun my-prompt-with-temporary-highlight ()
  "Ask for confirmation and highlight all instances of a regexp while waiting."
  (let ((regexp "(defun"))
    (unwind-protect
        (progn
          (highlight-regexp regexp)
          (if (y-or-n-p "Should we proceed or not? ")
              (message "You have decided to proceed")
            (message "You prefer not to continue")))
      (unhighlight-regexp regexp))))
\end{verbatim}

在你的 Emacs 中尝试上面的代码来感受一下。当“是或否”提示处于活动状态时，也执行 C-g (\texttt{keyboard-quit}) 或 C-] (\texttt{abort-recursive-edit}) 来确认即使代码从未通过提示阶段，高亮也会被移除。你甚至可以修改函数以产生错误：它将创建一个回溯（backtrace），在你从 \texttt{*Backtrace*} 窗口执行 q (\texttt{debugger-quit}) 后，仍然会产生回溯保护的效果。

\begin{verbatim}
(defun my-prompt-with-temporary-highlight-try-with-error ()
  "Ask for confirmation and highlight all instances of a regexp while waiting."
  (let ((regexp "(defun"))
    (unwind-protect
        (progn
          (highlight-regexp regexp)
          (error "This error makes no sense here; close the backtrace to test the unwinding")
          (if (y-or-n-p "Should we proceed or not? ")
              (message "You have decided to proceed")
            (message "You prefer not to continue")))
      (unhighlight-regexp regexp))))
\end{verbatim}

退一步看，你会发现 \texttt{unwind-protect} 是像 \texttt{save-excursion} 和 \texttt{save-restriction} (\hyperref[sec:org943a740]{切换到另一个缓冲区、窗口或 narrowed 状态}) 这样的专门形式的更通用形式，同时它支撑着 \texttt{save-match-data} (\hyperref[sec:org5d051bd]{上次搜索的匹配数据}) 以及许多其他函数/宏，例如 \texttt{with-temp-buffer} 和 \texttt{save-window-excursion\textasciitilde{}。\textasciitilde{}unwind-protect} 不做的是对信号（例如来自 \texttt{error} 函数的信号）做出特殊响应：它会允许错误发生，这意味着将显示回溯并且你的代码将在那里退出（但是回溯保护仍然会起作用，正如我已经解释过的，一旦你关闭回溯）。要让你的代码以更可控的方式处理信号，你必须依赖 \textasciitilde{}condition-case\textasciitilde{}。

使用 \texttt{condition-case\textasciitilde{}，你可以完全控制代码的行为，包括它应该如何处理错误。换句话说，你的 Elisp 将表达这样的意图：“我想做这个，但如果我得到一个错误，我想做那个来代替。” 有许多信号需要考虑，所有这些都来自 \textasciitilde{}signal} 函数。这些包括符号 \texttt{error\textasciitilde{}、\textasciitilde{}user-error\textasciitilde{}、\textasciitilde{}args-out-of-range\textasciitilde{}、\textasciitilde{}wrong-type-argument\textasciitilde{}、\textasciitilde{}wrong-length-argument} 和 \texttt{quit\textasciitilde{}，此外还有程序员可能认为必要的任何其他信号。在下面的代码块中，我向你展示 \textasciitilde{}condition-case} 的样子。请记住，有时由于底层形式的实现方式，你不会像通常那样进行引用 (\hyperref[sec:org6bfc8f0]{宏或特殊形式内部的求值})。我使用的例子与我用于 \texttt{unwind-protect} 的例子相同。

\begin{verbatim}
(defun my-prompt-with-temporary-highlight-and-signal-checks ()
  "Ask for confirmation and highlight all instances of a regexp while waiting."
  (let ((regexp "(defun"))
    (condition-case nil
        (progn
          (highlight-regexp regexp)
          (if (y-or-n-p "Should we proceed or not? ")
              (user-error "You have decided to proceed; but we need to return a `user-error'")
            (error "You prefer not to continue; but we need to return an `error'")))
      (:success
       (unhighlight-regexp regexp)
       (message "No errors, but still need to unwind what we did, plus whatever else we want here"))
      (quit
       (unhighlight-regexp regexp)
       (message "This is our response to the user aborting the prompt"))
      (user-error
       (unhighlight-regexp regexp)
       (message "This is our response to the `user-error' signal"))
      (error
       (unhighlight-regexp regexp)
       (message "This is our response to the `error' signal")))))
\end{verbatim}

上面的函数说明了前面提到的回溯保护概念和处理信号的机制。\textasciitilde{}condition-case\textasciitilde{} 的抽象结构在我看来像是 \texttt{let\textasciitilde{}、\textasciitilde{}unwind-protect} 和 \texttt{cond} 的混合体。这些条件可能包括特殊的处理程序 =:success=，正如我在那里展示的那样。诚然，我写的代码永远不会导致那个特定的成功情况，但你可以修改提示符之后发生的事情，比如说，调用 \texttt{message} 而不是 \texttt{user-error} 函数，这将被视为一个成功的结论。否则，我认为我写的表达式准确地告诉你这个程序如何响应它接收到的信号。

我还没有涵盖的是 \texttt{condition-case} 类似 \texttt{let} 的方面，即它如何将错误数据绑定到此作用域内的变量。在我上面的实现中，它是你看到的 \textasciitilde{}nil\textasciitilde{}，意味着我选择不执行这样的绑定，因为我不需要它的数据。下面我决定使用它，仅仅是为了演示。

\begin{verbatim}
(defun my-prompt-with-temporary-highlight-and-signal-checks-with-error-report ()
  "Ask for confirmation and highlight all instances of a regexp while waiting."
  (let ((regexp "(defun"))
    (condition-case error-data-i-got
        (progn
          (highlight-regexp regexp)
          (if (y-or-n-p "Should we proceed or not? ")
              (user-error "You have decided to proceed; but we need to return a `user-error'")
            (error "You prefer not to continue; but we need to return an `error'")))
      (:success
       (unhighlight-regexp regexp)
       (message "No errors, but still need to unwind what we did, plus whatever else we want here")
       (message "The error is `%s' and its data is `%S'" (car error-data-i-got) (cdr error-data-i-got)))
      (quit
       (unhighlight-regexp regexp)
       (message "This is our response to the user aborting the prompt")
       (message "The error is `%s' and its data is `%S'" (car error-data-i-got) (cdr error-data-i-got)))
      (user-error
       (unhighlight-regexp regexp)
       (message "This is our response to the `user-error' signal")
       (message "The error is `%s' and its data is `%S'" (car error-data-i-got) (cdr error-data-i-got)))
      (error
       (unhighlight-regexp regexp)
       (message "This is our response to the `error' signal")
       (message "The error is `%s' and its data is `%S'" (car error-data-i-got) (cdr error-data-i-got))))))
\end{verbatim}

有时 \texttt{unwind-protect} 和 \texttt{condition-case} 是适合这项工作的工具。我希望这些例子给了你宏观的视角，你现在已经准备好用 Emacs Lisp 编写你自己的程序了。
