技术文档/ELisp-Elements/elispelement-cn.org
* 何时使用命名函数或 lambda 函数
:PROPERTIES:
:CUSTOM_ID: h:when-to-use-a-named-function-or-a-lambda-function
:END:

#+findex: lambda
#+cindex: Anonymous and eponymous functions 匿名函数与同名函数
~lambda~ 是一个匿名函数。它与 ~defun~ 相对，后者定义一个具有给定名称的函数。何时使用哪一个很大程度上是风格问题。不过在某些情况下，某种方法更合适。经验法则是：如果你需要多次使用该函数，那么给它一个名字，然后通过名字调用它。否则，你实际上每次都会重新定义它，这使得重写你的程序变得困难。相比之下，如果函数只是临时相关的，那么使用 ~lambda~ 就可以了。

在某些情况下，你会有一个内部使用 ~lambda~ 的命名函数。修改你在本书中找到的一个例子 ([[#h:mapping-through-a-list-of-elements][遍历列表元素]])：

#+begin_src emacs-lisp
(defun my-increment-numbers-by-ten (numbers)
  "Add 10 to each number in NUMBERS and return the new list."
  (mapcar
   (lambda (number)
     (+ 10 number))
   numbers))

(my-increment-numbers-by-ten '(1 2 3))
;; => (11 12 13)
#+end_src

命名函数内部的 ~lambda~ 也可以在 ~let~ 的帮助下用于重复做某事。例如，你可能有一个函数需要使用 ~mapc~ 作为副作用来问候一个人员列表，并且你不想多次定义同一个函数：

#+begin_src emacs-lisp
(defun my-greet-teams (&rest teams)
  "Say hello to each person in TEAMS and return list with all persons per team.
Each member of TEAMS is a list of strings."
  (let* ((greet-name (lambda (name)
                       (message "Hello %s" name)))
         (greet-team-and-names (lambda (team)
                                 (message "Greeting the team of `%s'..." team)
                                 (mapc greet-name team))))
    (mapcar greet-team-and-names teams)))

(my-greet-teams
 '("Pelé" "Ronaldo")
 '("Maradona" "Messi")
 '("Beckenbauer" "Neuer")
 '("Platini" "Zidane")
 '("Baresi" "Maldini")
 '("Eusebio" "Cristiano Ronaldo")
 '("Xavi" "Iniesta")
 '("Charlton" "Shearer")
 '("Puskas" "Kubala")
 '("All of the Greece Euro 2004 squad ;)"))
;; => (("Pelé" "Ronaldo") ("Maradona" "Messi") ...)
#+end_src

#+cindex: View the echo area messages 查看回显区域消息
问候语在这种情况下是副作用，并且可以在 =*Messages*= 缓冲区中找到。你可以使用 {{{kbd(C-h e)}}} (~view-echo-area-messages~) 快速访问该缓冲区。~my-greet-teams~ 具体在做什么并不重要。关注命名函数和其内部匿名函数的组合。

* 让你的交互式函数也能从 Lisp 调用中工作
:PROPERTIES:
:CUSTOM_ID: h:make-your-interactive-function-also-work-from-lisp-calls
:END:

#+findex: interactive
#+findex: read-string
#+cindex: Interactive functions are commands 交互式函数即命令
#+cinfex: The interactive specification interactive 规范
当函数使用 ~interactive~ 规范声明时，它们可以交互式地使用。这会将它们变成“命令”。它们可以通过名称调用，首先执行 {{{kbd(M-x)}}} (~execute-extended-command~) 然后找到该命令。它们也可以分配给一个按键并直接通过按该键调用。在其最简单的形式中，~interactive~ 规范是一个未引用的列表，如 ~(interactive)~。这里有一个简单的例子，它调用 ~read-string~ 来产生一个 minibuffer 提示，该提示接受用户输入并将其作为字符串返回：

#+begin_src emacs-lisp
(defun my-greet-person ()
  (interactive)
  (message "Hello %s" (read-string "Whom to greet? ")))
#+end_src

上述实现的问题在于它仅在交互式使用中有用。如果你想通过程序非交互式地发出这样的问候，你需要编写另一个函数，该函数做几乎相同的事情，只是它接受一个 =NAME= 参数。像这样：

#+begin_src emacs-lisp
(defun my-greet-person-with-name (name)
  "Greet person with NAME."
  (message "Hello %s" name))
#+end_src

你不需要编写两个实际上做同样事情的独立函数。相反，你可以有一个带有参数的函数，它根据是交互式调用还是编程方式调用来决定如何获取传递给它的参数的值。考虑这种情况：

#+begin_src emacs-lisp
(defun my-greet-interactive-and-non-interactive (name)
  "Greet person with NAME.
When called interactively, produce a minibuffer prompt asking for NAME.

When called from Lisp, NAME is a string."
  (interactive (list (read-string "Whom to greet? ")))
  (message "Hello %s" name))
#+end_src

#+findex: defun
我在那里写的文档准确地告诉你发生了什么。不过让我进一步解释 ~interactive~：它接受一个参数，该参数是一个列表，对应于当前 ~defun~ 的参数列表。在这种情况下，~defun~ 有一个包含单个元素 =NAME= 的参数列表。因此，~interactive~ 也有一个包含一个元素的列表，其值对应于 =NAME=。如果参数不止一个，那么 ~interactive~ 必须相应地编写：它的每个元素将对应于列表中相同索引处的参数。

你传递给 ~interactive~ 的这个表达式列表本质上是将值绑定到参数的准备工作。当你交互式地调用上面的函数时，你实际上告诉 Emacs 在这种情况下 =NAME= 是调用 ~read-string~ 的返回值。对于更多参数，原理相同，但我还是写下来以明确说明：

#+begin_src emacs-lisp
(defun my-greet-with-two-parameters (name country)
  "Greet person with NAME from COUNTRY.
When called interactively, produce a minibuffer prompt asking for NAME
and then another prompt for COUNTRY.

When called from Lisp, NAME and COUNTRY are strings."
  (interactive
   (list
    (read-string "Whom to greet? ")
    (read-string "Where from? ")))
  (message "Hello %s of %s" name country))

(my-greet-with-two-parameters "Protesilaos" "Cyprus")
;; => "Hello Protesilaos of Cyprus"
#+end_src

仔细编写 ~interactive~ 规范，你最终会得到一个既经济又灵活的丰富代码库。

* 版权信息
:PROPERTIES:
:COPYING: t
:CUSTOM_ID: h:copying
:END:

版权所有 (C) 2025 Protesilaos Stavrou

#+begin_quote
授予复制、分发和/或修改本文档的权限，条件是遵守 GNU 自由文档许可证 1.3 版或自由软件基金会发布的任何后续版本的条款；不包含不变章节，封面文本为“A GNU Manual”，封底文本如 (a) 部分所述。许可证的副本包含在题为“GNU 自由文档许可证”的部分中。

(a) FSF 的封底文本是：“您拥有复制和修改本 GNU 手册的自由。”
#+end_quote

* GNU 自由文档许可证
:PROPERTIES:
:APPENDIX: t
:CUSTOM_ID: h:gnu-free-documentation-license
:END:

#+texinfo: @include doclicense.texi

#+begin_export html
<pre>

                GNU 自由文档许可证
                 版本 1.3，2008 年 11 月 3 日


 版权所有 (C) 2000, 2001, 2002, 2007, 2008 自由软件基金会公司
     <https://fsf.org/>
 允许任何人复制和分发本许可证文档的逐字副本，
 但不允许对其进行更改。

0. 序言

本许可证的目的是使手册、教科书或其他功能性和实用性文档在自由意义上“自由”：确保每个人都拥有复制和重新分发它的有效自由，无论是否对其进行修改，无论是商业目的还是非商业目的。其次，本许可证为作者和出版商保留了一种获得其工作成果荣誉的方式，同时不被视为对他人所做修改负责。

本许可证是一种“copyleft”，这意味着文档的衍生作品本身必须在相同意义上是自由的。它补充了 GNU 通用公共许可证，后者是为自由软件设计的 copyleft 许可证。

我们设计本许可证是为了将其用于自由软件的手册，因为自由软件需要自由文档：一个自由程序应该附带提供与软件相同自由的手册。但本许可证不仅限于软件手册；它可以用于任何文本作品，无论主题如何，也无论是否作为印刷书籍出版。我们主要推荐将本许可证用于以教学或参考为目的的作品。


1. 适用性和定义

本许可证适用于任何媒介中的任何手册或其他作品，只要其中包含版权持有者放置的声明，说明其可以根据本许可证的条款进行分发。这样的声明授予在全球范围内、免版税、无限期的许可证，以使用该作品，条件是遵守本文所述的条件。“文档”，如下文所述，指任何此类手册或作品。公众的任何成员都是被许可人，并被称为“您”。如果您以需要版权法许可的方式复制、修改或分发作品，则表示您接受该许可证。

文档的“修改版本”是指包含文档或其一部分的任何作品，无论是逐字复制，还是带有修改和/或翻译成另一种语言。

“次要章节”是文档的命名附录或卷首章节，专门处理文档的出版商或作者与文档整体主题（或相关事项）的关系，并且不包含任何可能直接属于该整体主题的内容。（因此，如果文档部分是数学教科书，则次要章节不得解释任何数学知识。）这种关系可能是与主题或相关事项的历史联系，或者是关于它们的法律、商业、哲学、伦理或政治立场。

“不变章节”是某些次要章节，其标题在说明文档根据本许可证发布的声明中被指定为不变章节的标题。如果某个章节不符合上述次要章节的定义，则不允许将其指定为不变。文档可能包含零个不变章节。如果文档未指明任何不变章节，则表示没有。

“封面文本”是某些简短的文本段落，它们在说明文档根据本许可证发布的声明中被列为封面文本或封底文本。封面文本最多可包含 5 个单词，封底文本最多可包含 25 个单词。

文档的“透明”副本是指机器可读的副本，以一种其规范可供公众使用的格式表示，适合使用通用文本编辑器或（对于由像素组成的图像）通用绘图程序或（对于绘图）某些广泛可用的绘图编辑器直接修改文档，并且适合输入到文本格式化程序或自动翻译成适合输入到文本格式化程序的各种格式。以其他透明文件格式制作的副本，如果其标记或缺少标记被安排用来阻碍或阻止读者后续修改，则不是透明的。如果图像格式用于任何大量的文本，则它不是透明的。不是“透明”的副本称为“不透明”。

透明副本的适用格式示例包括不带标记的纯 ASCII、Texinfo 输入格式、LaTeX 输入格式、使用公开可用的 DTD 的 SGML 或 XML，以及为人类修改设计的符合标准的简单 HTML、PostScript 或 PDF。透明图像格式的示例包括 PNG、XCF 和 JPG。不透明格式包括只能由专有文字处理器读取和编辑的专有格式、DTD 和/或处理工具通常不可用的 SGML 或 XML，以及某些文字处理器仅为输出目的生成的机器生成的 HTML、PostScript 或 PDF。

“扉页”是指对于印刷书籍而言，扉页本身，加上其后为清晰地容纳本许可证要求出现在扉页上的材料所需的页面。对于没有任何此类扉页格式的作品，“扉页”是指靠近作品标题最显着外观的文本，位于正文开始之前。

“出版商”是指向公众分发文档副本的任何个人或实体。

一个“题为 XYZ”的章节是指文档的一个命名子单元，其标题要么精确地是 XYZ，要么在翻译 XYZ 的文本后面用括号包含 XYZ。（这里的 XYZ 代表下面提到的特定章节名称，例如“致谢”、“题献”、“认可”或“历史”。）当您修改文档时，“保留标题”这样的章节意味着它根据此定义仍然是“题为 XYZ”的章节。

文档可能在声明本许可证适用于该文档的声明旁边包含免责声明。这些免责声明被视为通过引用包含在本许可证中，但仅限于免除保证责任：这些免责声明可能具有的任何其他含义都是无效的，并且对本许可证的含义没有影响。

2. 逐字复制

您可以在任何媒介中复制和分发文档，无论是商业目的还是非商业目的，前提是本许可证、版权声明以及说明本许可证适用于该文档的许可证声明在所有副本中均被复制，并且您不得在本许可证的条款之外添加任何其他条件。您不得使用技术措施来阻碍或控制您制作或分发的副本的阅读或进一步复制。但是，您可以接受报酬以换取副本。如果您分发足够大量的副本，您还必须遵守第 3 节中的条件。

您也可以在上述相同条件下出借副本，并且可以公开展示副本。


3. 大量复制

如果您出版文档的印刷副本（或通常带有印刷封面的媒介中的副本），数量超过 100 份，并且文档的许可证声明要求封面文本，则您必须将这些副本包含在清晰易读地载有所有这些封面文本的封面中：封面文本在封面上，封底文本在封底上。两个封面还必须清晰易读地标明您是这些副本的出版商。封面必须呈现完整的标题，标题的所有单词都同样突出和可见。您可以在封面上添加其他材料。只要保留文档标题并满足这些条件，仅限于封面的更改的复制在其他方面可以视为逐字复制。

如果任一封面所需的文本量过大而无法清晰容纳，您应该将首先列出的文本（尽可能多地合理容纳）放在实际封面上，并将其余部分继续到相邻页面上。

如果您出版或分发数量超过 100 份的文档不透明副本，您必须要么在每个不透明副本中包含一个机器可读的透明副本，要么在每个不透明副本中或随附说明一个计算机网络位置，普通网络用户可以从中通过公共标准网络协议下载文档的完整透明副本，不含附加材料。如果您使用后一种选项，则在开始大量分发不透明副本时，必须采取合理审慎的步骤，以确保此透明副本在该指定位置保持可访问状态，直到您最后一次向公众分发该版本的不透明副本（直接或通过您的代理商或零售商）后至少一年。

要求但不强制要求您在重新分发任何大量副本之前尽早联系文档的作者，让他们有机会为您提供文档的更新版本。


4. 修改

您可以在上述第 2 节和第 3 节的条件下复制和分发文档的修改版本，前提是您根据本许可证精确地发布修改版本，修改版本扮演文档的角色，从而将修改版本的分发和修改许可给拥有其副本的任何人。此外，您必须在修改版本中执行以下操作：

A. 在扉页（以及封面，如果有的话）上使用与文档标题以及先前版本（如果有的话，应在文档的历史记录部分列出）标题不同的标题。如果原始版本的原始出版商给予许可，您可以使用与先前版本相同的标题。
B. 在扉页上列出负责修改版本中修改内容的作者的一个或多个个人或实体，以及至少五位文档的主要作者（如果少于五位，则为其所有主要作者），除非他们免除您此项要求。
C. 在扉页上声明修改版本的出版商名称，作为出版商。
D. 保留文档的所有版权声明。
E. 在其他版权声明旁边添加适合您修改的版权声明。
F. 在版权声明之后立即包含一个许可证声明，允许公众根据本许可证的条款使用修改版本，格式如下文附录所示。
G. 在该许可证声明中保留文档许可证声明中给出的不变章节和所需封面文本的完整列表。
H. 包含本许可证的未更改副本。
I. 保留题为“历史记录”的章节，保留其标题，并向其添加一个项目，至少说明扉页上给出的修改版本的标题、年份、新作者和出版商。如果文档中没有题为“历史记录”的章节，则创建一个说明文档扉页上给出的文档标题、年份、作者和出版商的章节，然后添加一个如前一句所述描述修改版本的项目。
J. 保留文档中为公众访问文档透明副本而给出的网络位置（如果有），以及文档中为其所基于的先前版本给出的网络位置。这些可以放在“历史记录”部分。对于在文档本身发布至少四年前发布的作品，或者如果其引用的版本的原始出版商给予许可，您可以省略网络位置。
K. 对于任何题为“致谢”或“题献”的章节，保留该章节的标题，并在该章节中保留其中给出的每个贡献者致谢和/或题献的全部实质内容和语气。
L. 保留文档的所有不变章节，其文本和标题均不得更改。章节编号或等效物不视为章节标题的一部分。
M. 删除任何题为“认可”的章节。此类章节不得包含在修改版本中。
N. 不要将任何现有章节重新命名为“认可”或与任何不变章节的标题冲突。
O. 保留任何免责声明。

如果修改版本包含符合次要章节条件且不包含从文档复制的材料的新卷首章节或附录，您可以选择将这些章节的部分或全部指定为不变。为此，请将其标题添加到修改版本许可证声明中的不变章节列表中。这些标题必须与任何其他章节标题不同。

您可以添加一个题为“认可”的章节，前提是它只包含各方对您修改版本的认可——例如，同行评审的声明或某个组织已批准该文本作为标准的权威定义的声明。

您可以在修改版本封面文本列表的末尾添加一段最多五个单词的封面文本和一段最多二十五个单词的封底文本。任何一个实体只能添加（或通过安排添加）一段封面文本和一段封底文本。如果文档已经包含您先前添加的或通过您代表的同一实体安排添加的同一封面的封面文本，则您不得再添加；但经添加旧文本的先前出版商明确许可，您可以替换旧文本。

文档的作者和出版商不通过本许可证授予使用其名称进行宣传或主张或暗示对任何修改版本的认可的权限。


5. 合并文档

您可以将本文档与根据本许可证发布的其他文档合并，条件是遵守上述第 4 节中为修改版本定义的条款，前提是您在合并中包含所有原始文档的所有不变章节，未经修改，并在合并作品的许可证声明中将它们全部列为不变章节，并且保留它们所有的免责声明。

合并后的作品只需要包含本许可证的一份副本，多个相同的不变章节可以用一份副本替换。如果存在名称相同但内容不同的多个不变章节，请在每个此类章节的标题末尾添加括号，说明该章节的原始作者或出版商（如果知道），或者一个唯一的编号，以使该章节的标题唯一。在合并作品的许可证声明中的不变章节列表中对章节标题进行相同的调整。

在合并中，您必须合并各个原始文档中任何题为“历史记录”的章节，形成一个题为“历史记录”的章节；同样合并任何题为“致谢”的章节，以及任何题为“题献”的章节。您必须删除所有题为“认可”的章节。


6. 文档集合

您可以制作一个包含本文档和根据本许可证发布的其他文档的集合，并将各个文档中本许可证的单独副本替换为集合中包含的单个副本，前提是您在所有其他方面遵守本许可证关于集合中每个文档逐字复制的规则。

您可以从此类集合中提取单个文档，并根据本许可证单独分发它，前提是您在提取的文档中插入本许可证的副本，并在所有其他方面遵守本许可证关于该文档逐字复制的规定。


7. 与独立作品聚合

将本文档或其衍生品与其他独立文档或作品在存储或分发媒介的卷中进行汇编，称为“聚合体”，如果汇编产生的版权未被用于限制汇编用户的合法权利超出单个作品所允许的范围。当本文档包含在聚合体中时，本许可证不适用于聚合体中本身不是本文档衍生品的其他作品。

如果第 3 节的封面文本要求适用于本文档的这些副本，那么如果本文档少于整个聚合体的一半，则本文档的封面文本可以放在聚合体内框住本文档的封面上，或者如果本文档是电子形式，则放在封面的电子等效物上。否则，它们必须出现在框住整个聚合体的印刷封面上。


8. 翻译

翻译被视为一种修改，因此您可以在第 4 节的条款下分发文档的翻译。用翻译替换不变章节需要其版权持有者的特别许可，但您可以在这些不变章节的原始版本之外包含部分或全部不变章节的翻译。您可以包含本许可证的翻译、文档中的所有许可证声明以及任何免责声明，前提是您还包含本许可证的原始英文版本以及这些声明和免责声明的原始版本。如果翻译与本许可证或声明或免责声明的原始版本之间存在分歧，则以原始版本为准。

如果文档中的某个章节题为“致谢”、“题献”或“历史记录”，则保留其标题的要求（第 4 节）（第 1 节）通常需要更改实际标题。


9. 终止

除非本许可证明确规定，否则您不得复制、修改、再许可或分发本文档。任何其他复制、修改、再许可或分发本文档的尝试都是无效的，并将自动终止您在本许可证下的权利。

但是，如果您停止所有违反本许可证的行为，那么您从特定版权持有者那里获得的许可证将（a）暂时恢复，除非且直到版权持有者明确且最终终止您的许可证，并且（b）永久恢复，如果版权持有者未能在停止违规后 60 天内通过某种合理方式通知您违规行为。

此外，如果版权持有者通过某种合理方式通知您违规行为，这是您第一次收到该版权持有者关于违反本许可证（针对任何作品）的通知，并且您在收到通知后 30 天内纠正了违规行为，则您从特定版权持有者那里获得的许可证将永久恢复。

根据本节终止您的权利不会终止根据本许可证从您那里收到副本或权利的各方的许可证。如果您的权利已被终止且未永久恢复，收到部分或全部相同材料的副本不会给予您使用它的任何权利。


10. 本许可证的未来修订

自由软件基金会可能会不时发布 GNU 自由文档许可证的新修订版本。此类新版本将在精神上与当前版本相似，但可能在细节上有所不同，以解决新的问题或关注点。请参阅 https://www.gnu.org/licenses/。

许可证的每个版本都有一个区分性的版本号。如果文档指定适用于它的特定编号版本的本许可证“或任何更高版本”，您可以选择遵循该指定版本或自由软件基金会发布的任何更高版本（非草案）的条款和条件。如果文档未指定本许可证的版本号，您可以选择自由软件基金会发布的任何版本（非草案）。如果文档指定代理可以决定可以使用本许可证的哪些未来版本，则该代理接受某个版本的公开声明将永久授权您为该文档选择该版本。

11. 再许可

“大规模多作者协作站点”（或“MMC 站点”）是指任何发布受版权保护作品并为任何人编辑这些作品提供显着便利的世界万维网服务器。任何人都可以编辑的公共维基就是此类服务器的一个示例。站点中包含的“大规模多作者协作”（或“MMC”）是指在该 MMC 站点上发布的任何一组受版权保护的作品。

“CC-BY-SA”是指由 Creative Commons Corporation（一家主要营业地在加利福尼亚州旧金山的非营利性公司）发布的知识共享署名-相同方式共享 3.0 许可证，以及该同一组织发布的该许可证的未来 copyleft 版本。

“合并”是指将文档全部或部分作为另一文档的一部分发布或重新发布。

如果一个 MMC (1) 根据本许可证获得许可，并且 (2) 所有首次在本 MMC 之外的其他地方根据本许可证发布，随后全部或部分合并到 MMC 中的作品，(1) 没有封面文本或不变章节，并且 (2) 是在 2008 年 11 月 1 日之前这样合并的，则该 MMC “有资格进行再许可”。

MMC 站点的运营商可以在 2009 年 8 月 1 日之前的任何时间，在同一站点上根据 CC-BY-SA 重新发布站点中包含的 MMC，前提是该 MMC 有资格进行再许可。


附录：如何为您的文档使用本许可证

要在您编写的文档中使用本许可证，请在文档中包含本许可证的副本，并在扉页之后立即放置以下版权和许可证声明：

    版权所有 (c) 年份 您的姓名。
    授予复制、分发和/或修改本文档的权限，条件是遵守 GNU 自由文档许可证 1.3 版
    或自由软件基金会发布的任何后续版本的条款；
    不包含不变章节、封面文本和封底文本。
    许可证的副本包含在题为“GNU
    自由文档许可证”的部分中。

如果您有不变章节、封面文本和封底文本，请将“不包含...文本。”一行替换为：

    不变章节为 列出它们的标题，封面文本为 列出，封底文本为 列出。

如果您有不变章节但没有封面文本，或其他三者的组合，请合并这两种替代方案以适应情况。

如果您的文档包含重要的程序代码示例，我们建议根据您选择的自由软件许可证（例如 GNU 通用公共许可证）并行发布这些示例，以允许它们在自由软件中使用。
</pre>
#+end_export

#+html: <!--

* 索引
:PROPERTIES:
:CUSTOM_ID: h:indices
:END:

