技术文档/ELisp-Elements/elispelement-cn.tex
\section{何时使用命名函数或 lambda 函数}
\label{sec:orgf242639}
\texttt{lambda} 是一个匿名函数。它与 \texttt{defun} 相对，后者定义一个具有给定名称的函数。何时使用哪一个很大程度上是风格问题。不过在某些情况下，某种方法更合适。经验法则是：如果你需要多次使用该函数，那么给它一个名字，然后通过名字调用它。否则，你实际上每次都会重新定义它，这使得重写你的程序变得困难。相比之下，如果函数只是临时相关的，那么使用 \texttt{lambda} 就可以了。

在某些情况下，你会有一个内部使用 \texttt{lambda} 的命名函数。修改你在本书中找到的一个例子 (\hyperref[sec:org94bd4fd]{遍历列表元素})：

\begin{verbatim}
(defun my-increment-numbers-by-ten (numbers)
  "Add 10 to each number in NUMBERS and return the new list."
  (mapcar
   (lambda (number)
     (+ 10 number))
   numbers))

(my-increment-numbers-by-ten '(1 2 3))
;; => (11 12 13)
\end{verbatim}

命名函数内部的 \texttt{lambda} 也可以在 \texttt{let} 的帮助下用于重复做某事。例如，你可能有一个函数需要使用 \texttt{mapc} 作为副作用来问候一个人员列表，并且你不想多次定义同一个函数：

\begin{verbatim}
(defun my-greet-teams (&rest teams)
  "Say hello to each person in TEAMS and return list with all persons per team.
Each member of TEAMS is a list of strings."
  (let* ((greet-name (lambda (name)
                       (message "Hello %s" name)))
         (greet-team-and-names (lambda (team)
                                 (message "Greeting the team of `%s'..." team)
                                 (mapc greet-name team))))
    (mapcar greet-team-and-names teams)))

(my-greet-teams
 '("Pelé" "Ronaldo")
 '("Maradona" "Messi")
 '("Beckenbauer" "Neuer")
 '("Platini" "Zidane")
 '("Baresi" "Maldini")
 '("Eusebio" "Cristiano Ronaldo")
 '("Xavi" "Iniesta")
 '("Charlton" "Shearer")
 '("Puskas" "Kubala")
 '("All of the Greece Euro 2004 squad ;)"))
;; => (("Pelé" "Ronaldo") ("Maradona" "Messi") ...)
\end{verbatim}

问候语在这种情况下是副作用，并且可以在 \texttt{*Messages*} 缓冲区中找到。你可以使用 C-h e (\texttt{view-echo-area-messages}) 快速访问该缓冲区。\textasciitilde{}my-greet-teams\textasciitilde{} 具体在做什么并不重要。关注命名函数和其内部匿名函数的组合。
\section{让你的交互式函数也能从 Lisp 调用中工作}
\label{sec:orgf9b460c}
当函数使用 \texttt{interactive} 规范声明时，它们可以交互式地使用。这会将它们变成“命令”。它们可以通过名称调用，首先执行 M-x (\texttt{execute-extended-command}) 然后找到该命令。它们也可以分配给一个按键并直接通过按该键调用。在其最简单的形式中，\textasciitilde{}interactive\textasciitilde{} 规范是一个未引用的列表，如 \texttt{(interactive)\textasciitilde{}。这里有一个简单的例子，它调用 \textasciitilde{}read-string} 来产生一个 minibuffer 提示，该提示接受用户输入并将其作为字符串返回：

\begin{verbatim}
(defun my-greet-person ()
  (interactive)
  (message "Hello %s" (read-string "Whom to greet? ")))
\end{verbatim}

上述实现的问题在于它仅在交互式使用中有用。如果你想通过程序非交互式地发出这样的问候，你需要编写另一个函数，该函数做几乎相同的事情，只是它接受一个 \texttt{NAME} 参数。像这样：

\begin{verbatim}
(defun my-greet-person-with-name (name)
  "Greet person with NAME."
  (message "Hello %s" name))
\end{verbatim}

你不需要编写两个实际上做同样事情的独立函数。相反，你可以有一个带有参数的函数，它根据是交互式调用还是编程方式调用来决定如何获取传递给它的参数的值。考虑这种情况：

\begin{verbatim}
(defun my-greet-interactive-and-non-interactive (name)
  "Greet person with NAME.
When called interactively, produce a minibuffer prompt asking for NAME.

When called from Lisp, NAME is a string."
  (interactive (list (read-string "Whom to greet? ")))
  (message "Hello %s" name))
\end{verbatim}

我在那里写的文档准确地告诉你发生了什么。不过让我进一步解释 \texttt{interactive\textasciitilde{}：它接受一个参数，该参数是一个列表，对应于当前 \textasciitilde{}defun} 的参数列表。在这种情况下，\textasciitilde{}defun\textasciitilde{} 有一个包含单个元素 \texttt{NAME} 的参数列表。因此，\textasciitilde{}interactive\textasciitilde{} 也有一个包含一个元素的列表，其值对应于 =NAME=。如果参数不止一个，那么 \texttt{interactive} 必须相应地编写：它的每个元素将对应于列表中相同索引处的参数。

你传递给 \texttt{interactive} 的这个表达式列表本质上是将值绑定到参数的准备工作。当你交互式地调用上面的函数时，你实际上告诉 Emacs 在这种情况下 \texttt{NAME} 是调用 \texttt{read-string} 的返回值。对于更多参数，原理相同，但我还是写下来以明确说明：

\begin{verbatim}
(defun my-greet-with-two-parameters (name country)
  "Greet person with NAME from COUNTRY.
When called interactively, produce a minibuffer prompt asking for NAME
and then another prompt for COUNTRY.

When called from Lisp, NAME and COUNTRY are strings."
  (interactive
   (list
    (read-string "Whom to greet? ")
    (read-string "Where from? ")))
  (message "Hello %s of %s" name country))

(my-greet-with-two-parameters "Protesilaos" "Cyprus")
;; => "Hello Protesilaos of Cyprus"
\end{verbatim}

仔细编写 \texttt{interactive} 规范，你最终会得到一个既经济又灵活的丰富代码库。
\section{版权信息}
\label{sec:orgb1d6db4}
版权所有 (C) 2025 Protesilaos Stavrou

\begin{quote}
授予复制、分发和/或修改本文档的权限，条件是遵守 GNU 自由文档许可证 1.3 版或自由软件基金会发布的任何后续版本的条款；不包含不变章节，封面文本为“A GNU Manual”，封底文本如 (a) 部分所述。许可证的副本包含在题为“GNU 自由文档许可证”的部分中。

(a) FSF 的封底文本是：“您拥有复制和修改本 GNU 手册的自由。”
\end{quote}
\section{GNU 自由文档许可证}
\label{sec:org2685c88}
\section{索引}
\label{sec:org07d5484}
\subsection{函数索引}
\label{sec:orga2eecfa}
\subsection{变量索引}
\label{sec:orga157eb7}
\subsection{概念索引}
\label{sec:org9959451}
```
\end{document}
